Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_ppb.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; RP2350_ppb.
; ===========

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     RP2350_ppb equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// PPB address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    ITM_STIM0;
    volatile    uint32_t    ITM_STIM1;
    volatile    uint32_t    ITM_STIM2;
    volatile    uint32_t    ITM_STIM3;
    volatile    uint32_t    ITM_STIM4;
    volatile    uint32_t    ITM_STIM5;
    volatile    uint32_t    ITM_STIM6;
    volatile    uint32_t    ITM_STIM7;
    volatile    uint32_t    ITM_STIM8;
    volatile    uint32_t    ITM_STIM9;
    volatile    uint32_t    ITM_STIM10;
    volatile    uint32_t    ITM_STIM11;
    volatile    uint32_t    ITM_STIM12;
    volatile    uint32_t    ITM_STIM13;
    volatile    uint32_t    ITM_STIM14;
    volatile    uint32_t    ITM_STIM15;
    volatile    uint32_t    ITM_STIM16;
    volatile    uint32_t    ITM_STIM17;
    volatile    uint32_t    ITM_STIM18;
    volatile    uint32_t    ITM_STIM19;
    volatile    uint32_t    ITM_STIM20;
    volatile    uint32_t    ITM_STIM21;
    volatile    uint32_t    ITM_STIM22;
    volatile    uint32_t    ITM_STIM23;
    volatile    uint32_t    ITM_STIM24;
    volatile    uint32_t    ITM_STIM25;
    volatile    uint32_t    ITM_STIM26;
    volatile    uint32_t    ITM_STIM27;
    volatile    uint32_t    ITM_STIM28;
    volatile    uint32_t    ITM_STIM29;
    volatile    uint32_t    ITM_STIM30;
    volatile    uint32_t    ITM_STIM31;
    volatile    uint32_t    RESERVED0[864];
    volatile    uint32_t    ITM_TER0;
    volatile    uint32_t    RESERVED1[15];
    volatile    uint32_t    ITM_TPR;
    volatile    uint32_t    RESERVED2[15];
    volatile    uint32_t    ITM_TCR;
    volatile    uint32_t    RESERVED3[27];
    volatile    uint32_t    INT_ATREADY;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    INT_ATVALID;
    volatile    uint32_t    RESERVED5;
    volatile    uint32_t    ITM_ITCTRL;
    volatile    uint32_t    RESERVED6[46];
    volatile    uint32_t    ITM_DEVARCH;
    volatile    uint32_t    RESERVED7[3];
    volatile    uint32_t    ITM_DEVTYPE;
    volatile    uint32_t    ITM_PIDR4;
    volatile    uint32_t    ITM_PIDR5;
    volatile    uint32_t    ITM_PIDR6;
    volatile    uint32_t    ITM_PIDR7;
    volatile    uint32_t    ITM_PIDR0;
    volatile    uint32_t    ITM_PIDR1;
    volatile    uint32_t    ITM_PIDR2;
    volatile    uint32_t    ITM_PIDR3;
    volatile    uint32_t    ITM_CIDR0;
    volatile    uint32_t    ITM_CIDR1;
    volatile    uint32_t    ITM_CIDR2;
    volatile    uint32_t    ITM_CIDR3;
    volatile    uint32_t    DWT_CTRL;
    volatile    uint32_t    DWT_CYCCNT;
    volatile    uint32_t    RESERVED8;
    volatile    uint32_t    DWT_EXCCNT;
    volatile    uint32_t    RESERVED9;
    volatile    uint32_t    DWT_LSUCNT;
    volatile    uint32_t    DWT_FOLDCNT;
    volatile    uint32_t    RESERVED10;
    volatile    uint32_t    DWT_COMP0;
    volatile    uint32_t    RESERVED11;
    volatile    uint32_t    DWT_FUNCTION0;
    volatile    uint32_t    RESERVED12;
    volatile    uint32_t    DWT_COMP1;
    volatile    uint32_t    RESERVED13;
    volatile    uint32_t    DWT_FUNCTION1;
    volatile    uint32_t    RESERVED14;
    volatile    uint32_t    DWT_COMP2;
    volatile    uint32_t    RESERVED15;
    volatile    uint32_t    DWT_FUNCTION2;
    volatile    uint32_t    RESERVED16;
    volatile    uint32_t    DWT_COMP3;
    volatile    uint32_t    RESERVED17;
    volatile    uint32_t    DWT_FUNCTION3;
    volatile    uint32_t    RESERVED18[984];
    volatile    uint32_t    DWT_DEVARCH;
    volatile    uint32_t    RESERVED19[3];
    volatile    uint32_t    DWT_DEVTYPE;
    volatile    uint32_t    DWT_PIDR4;
    volatile    uint32_t    DWT_PIDR5;
    volatile    uint32_t    DWT_PIDR6;
    volatile    uint32_t    DWT_PIDR7;
    volatile    uint32_t    DWT_PIDR0;
    volatile    uint32_t    DWT_PIDR1;
    volatile    uint32_t    DWT_PIDR2;
    volatile    uint32_t    DWT_PIDR3;
    volatile    uint32_t    DWT_CIDR0;
    volatile    uint32_t    DWT_CIDR1;
    volatile    uint32_t    DWT_CIDR2;
    volatile    uint32_t    DWT_CIDR3;
    volatile    uint32_t    FP_CTRL;
    volatile    uint32_t    FP_REMAP;
    volatile    uint32_t    FP_COMP0;
    volatile    uint32_t    FP_COMP1;
    volatile    uint32_t    FP_COMP2;
    volatile    uint32_t    FP_COMP3;
    volatile    uint32_t    FP_COMP4;
    volatile    uint32_t    FP_COMP5;
    volatile    uint32_t    FP_COMP6;
    volatile    uint32_t    FP_COMP7;
    volatile    uint32_t    RESERVED20[997];
    volatile    uint32_t    FP_DEVARCH;
    volatile    uint32_t    RESERVED21[3];
    volatile    uint32_t    FP_DEVTYPE;
    volatile    uint32_t    FP_PIDR4;
    volatile    uint32_t    FP_PIDR5;
    volatile    uint32_t    FP_PIDR6;
    volatile    uint32_t    FP_PIDR7;
    volatile    uint32_t    FP_PIDR0;
    volatile    uint32_t    FP_PIDR1;
    volatile    uint32_t    FP_PIDR2;
    volatile    uint32_t    FP_PIDR3;
    volatile    uint32_t    FP_CIDR0;
    volatile    uint32_t    FP_CIDR1;
    volatile    uint32_t    FP_CIDR2;
    volatile    uint32_t    FP_CIDR3;
    volatile    uint32_t    RESERVED22[11265];
    volatile    uint32_t    ICTR;
    volatile    uint32_t    ACTLR;
    volatile    uint32_t    RESERVED23;
    volatile    uint32_t    SYST_CSR;
    volatile    uint32_t    SYST_RVR;
    volatile    uint32_t    SYST_CVR;
    volatile    uint32_t    SYST_CALIB;
    volatile    uint32_t    RESERVED24[56];
    volatile    uint32_t    NVIC_ISER0;
    volatile    uint32_t    NVIC_ISER1;
    volatile    uint32_t    RESERVED25[30];
    volatile    uint32_t    NVIC_ICER0;
    volatile    uint32_t    NVIC_ICER1;
    volatile    uint32_t    RESERVED26[30];
    volatile    uint32_t    NVIC_ISPR0;
    volatile    uint32_t    NVIC_ISPR1;
    volatile    uint32_t    RESERVED27[30];
    volatile    uint32_t    NVIC_ICPR0;
    volatile    uint32_t    NVIC_ICPR1;
    volatile    uint32_t    RESERVED28[30];
    volatile    uint32_t    NVIC_IABR0;
    volatile    uint32_t    NVIC_IABR1;
    volatile    uint32_t    RESERVED29[30];
    volatile    uint32_t    NVIC_ITNS0;
    volatile    uint32_t    NVIC_ITNS1;
    volatile    uint32_t    RESERVED30[30];
    volatile    uint32_t    NVIC_IPR0;
    volatile    uint32_t    NVIC_IPR1;
    volatile    uint32_t    NVIC_IPR2;
    volatile    uint32_t    NVIC_IPR3;
    volatile    uint32_t    NVIC_IPR4;
    volatile    uint32_t    NVIC_IPR5;
    volatile    uint32_t    NVIC_IPR6;
    volatile    uint32_t    NVIC_IPR7;
    volatile    uint32_t    NVIC_IPR8;
    volatile    uint32_t    NVIC_IPR9;
    volatile    uint32_t    NVIC_IPR10;
    volatile    uint32_t    NVIC_IPR11;
    volatile    uint32_t    NVIC_IPR12;
    volatile    uint32_t    NVIC_IPR13;
    volatile    uint32_t    NVIC_IPR14;
    volatile    uint32_t    NVIC_IPR15;
    volatile    uint32_t    RESERVED31[560];
    volatile    uint32_t    CPUID;
    volatile    uint32_t    ICSR;
    volatile    uint32_t    VTOR;
    volatile    uint32_t    AIRCR;
    volatile    uint32_t    SCR;
    volatile    uint32_t    CCR;
    volatile    uint32_t    SHPR1;
    volatile    uint32_t    SHPR2;
    volatile    uint32_t    SHPR3;
    volatile    uint32_t    SHCSR;
    volatile    uint32_t    CFSR;
    volatile    uint32_t    HFSR;
    volatile    uint32_t    DFSR;
    volatile    uint32_t    MMFAR;
    volatile    uint32_t    BFAR;
    volatile    uint32_t    RESERVED32;
    volatile    uint32_t    ID_PFR0;
    volatile    uint32_t    ID_PFR1;
    volatile    uint32_t    ID_DFR0;
    volatile    uint32_t    ID_AFR0;
    volatile    uint32_t    ID_MMFR0;
    volatile    uint32_t    ID_MMFR1;
    volatile    uint32_t    ID_MMFR2;
    volatile    uint32_t    ID_MMFR3;
    volatile    uint32_t    ID_ISAR0;
    volatile    uint32_t    ID_ISAR1;
    volatile    uint32_t    ID_ISAR2;
    volatile    uint32_t    ID_ISAR3;
    volatile    uint32_t    ID_ISAR4;
    volatile    uint32_t    ID_ISAR5;
    volatile    uint32_t    RESERVED33;
    volatile    uint32_t    CTR;
    volatile    uint32_t    RESERVED34[2];
    volatile    uint32_t    CPACR;
    volatile    uint32_t    NSACR;
    volatile    uint32_t    MPU_TYPE;
    volatile    uint32_t    MPU_CTRL;
    volatile    uint32_t    MPU_RNR;
    volatile    uint32_t    MPU_RBAR;
    volatile    uint32_t    MPU_RLAR;
    volatile    uint32_t    MPU_RBAR_A1;
    volatile    uint32_t    MPU_RLAR_A1;
    volatile    uint32_t    MPU_RBAR_A2;
    volatile    uint32_t    MPU_RLAR_A2;
    volatile    uint32_t    MPU_RBAR_A3;
    volatile    uint32_t    MPU_RLAR_A3;
    volatile    uint32_t    RESERVED35;
    volatile    uint32_t    MPU_MAIR0;
    volatile    uint32_t    MPU_MAIR1;
    volatile    uint32_t    RESERVED36[2];
    volatile    uint32_t    SAU_CTRL;
    volatile    uint32_t    SAU_TYPE;
    volatile    uint32_t    SAU_RNR;
    volatile    uint32_t    SAU_RBAR;
    volatile    uint32_t    SAU_RLAR;
    volatile    uint32_t    SFSR;
    volatile    uint32_t    SFAR;
    volatile    uint32_t    RESERVED37;
    volatile    uint32_t    DHCSR;
    volatile    uint32_t    DCRSR;
    volatile    uint32_t    DCRDR;
    volatile    uint32_t    DEMCR;
    volatile    uint32_t    RESERVED38[2];
    volatile    uint32_t    DSCSR;
    volatile    uint32_t    RESERVED39[61];
    volatile    uint32_t    STIR;
    volatile    uint32_t    RESERVED40[12];
    volatile    uint32_t    FPCCR;
    volatile    uint32_t    FPCAR;
    volatile    uint32_t    FPDSCR;
    volatile    uint32_t    MVFR0;
    volatile    uint32_t    MVFR1;
    volatile    uint32_t    MVFR2;
    volatile    uint32_t    RESERVED41[28];
    volatile    uint32_t    DDEVARCH;
    volatile    uint32_t    RESERVED42[3];
    volatile    uint32_t    DDEVTYPE;
    volatile    uint32_t    DPIDR4;
    volatile    uint32_t    DPIDR5;
    volatile    uint32_t    DPIDR6;
    volatile    uint32_t    DPIDR7;
    volatile    uint32_t    DPIDR0;
    volatile    uint32_t    DPIDR1;
    volatile    uint32_t    DPIDR2;
    volatile    uint32_t    DPIDR3;
    volatile    uint32_t    DCIDR0;
    volatile    uint32_t    DCIDR1;
    volatile    uint32_t    DCIDR2;
    volatile    uint32_t    DCIDR3;
    volatile    uint32_t    RESERVED43[51201];
    volatile    uint32_t    TRCPRGCTLR;
    volatile    uint32_t    RESERVED44;
    volatile    uint32_t    TRCSTATR;
    volatile    uint32_t    TRCCONFIGR;
    volatile    uint32_t    RESERVED45[3];
    volatile    uint32_t    TRCEVENTCTL0R;
    volatile    uint32_t    TRCEVENTCTL1R;
    volatile    uint32_t    RESERVED46;
    volatile    uint32_t    TRCSTALLCTLR;
    volatile    uint32_t    TRCTSCTLR;
    volatile    uint32_t    TRCSYNCPR;
    volatile    uint32_t    TRCCCCTLR;
    volatile    uint32_t    RESERVED47[17];
    volatile    uint32_t    TRCVICTLR;
    volatile    uint32_t    RESERVED48[47];
    volatile    uint32_t    TRCCNTRLDVR0;
    volatile    uint32_t    RESERVED49[15];
    volatile    uint32_t    TRCIDR8;
    volatile    uint32_t    TRCIDR9;
    volatile    uint32_t    TRCIDR10;
    volatile    uint32_t    TRCIDR11;
    volatile    uint32_t    TRCIDR12;
    volatile    uint32_t    TRCIDR13;
    volatile    uint32_t    RESERVED50[10];
    volatile    uint32_t    TRCIMSPEC;
    volatile    uint32_t    RESERVED51[7];
    volatile    uint32_t    TRCIDR0;
    volatile    uint32_t    TRCIDR1;
    volatile    uint32_t    TRCIDR2;
    volatile    uint32_t    TRCIDR3;
    volatile    uint32_t    TRCIDR4;
    volatile    uint32_t    TRCIDR5;
    volatile    uint32_t    TRCIDR6;
    volatile    uint32_t    TRCIDR7;
    volatile    uint32_t    RESERVED52[2];
    volatile    uint32_t    TRCRSCTLR2;
    volatile    uint32_t    TRCRSCTLR3;
    volatile    uint32_t    RESERVED53[36];
    volatile    uint32_t    TRCSSCSR;
    volatile    uint32_t    RESERVED54[7];
    volatile    uint32_t    TRCSSPCICR;
    volatile    uint32_t    RESERVED55[19];
    volatile    uint32_t    TRCPDCR;
    volatile    uint32_t    TRCPDSR;
    volatile    uint32_t    RESERVED56[755];
    volatile    uint32_t    TRCITATBIDR;
    volatile    uint32_t    RESERVED57[3];
    volatile    uint32_t    TRCITIATBINR;
    volatile    uint32_t    RESERVED58;
    volatile    uint32_t    TRCITIATBOUTR;
    volatile    uint32_t    RESERVED59[40];
    volatile    uint32_t    TRCCLAIMSET;
    volatile    uint32_t    TRCCLAIMCLR;
    volatile    uint32_t    RESERVED60[4];
    volatile    uint32_t    TRCAUTHSTATUS;
    volatile    uint32_t    TRCDEVARCH;
    volatile    uint32_t    RESERVED61[2];
    volatile    uint32_t    TRCDEVID;
    volatile    uint32_t    TRCDEVTYPE;
    volatile    uint32_t    TRCPIDR4;
    volatile    uint32_t    TRCPIDR5;
    volatile    uint32_t    TRCPIDR6;
    volatile    uint32_t    TRCPIDR7;
    volatile    uint32_t    TRCPIDR0;
    volatile    uint32_t    TRCPIDR1;
    volatile    uint32_t    TRCPIDR2;
    volatile    uint32_t    TRCPIDR3;
    volatile    uint32_t    TRCCIDR0;
    volatile    uint32_t    TRCCIDR1;
    volatile    uint32_t    TRCCIDR2;
    volatile    uint32_t    TRCCIDR3;
    volatile    uint32_t    CTICONTROL;
    volatile    uint32_t    RESERVED62[3];
    volatile    uint32_t    CTIINTACK;
    volatile    uint32_t    CTIAPPSET;
    volatile    uint32_t    CTIAPPCLEAR;
    volatile    uint32_t    CTIAPPPULSE;
    volatile    uint32_t    CTIINEN0;
    volatile    uint32_t    CTIINEN1;
    volatile    uint32_t    CTIINEN2;
    volatile    uint32_t    CTIINEN3;
    volatile    uint32_t    CTIINEN4;
    volatile    uint32_t    CTIINEN5;
    volatile    uint32_t    CTIINEN6;
    volatile    uint32_t    CTIINEN7;
    volatile    uint32_t    RESERVED63[24];
    volatile    uint32_t    CTIOUTEN0;
    volatile    uint32_t    CTIOUTEN1;
    volatile    uint32_t    CTIOUTEN2;
    volatile    uint32_t    CTIOUTEN3;
    volatile    uint32_t    CTIOUTEN4;
    volatile    uint32_t    CTIOUTEN5;
    volatile    uint32_t    CTIOUTEN6;
    volatile    uint32_t    CTIOUTEN7;
    volatile    uint32_t    RESERVED64[28];
    volatile    uint32_t    CTITRIGINSTATUS;
    volatile    uint32_t    CTITRIGOUTSTATUS;
    volatile    uint32_t    CTICHINSTATUS;
    volatile    uint32_t    RESERVED65;
    volatile    uint32_t    CTIGATE;
    volatile    uint32_t    ASICCTL;
    volatile    uint32_t    RESERVED66[871];
    volatile    uint32_t    ITCHOUT;
    volatile    uint32_t    ITTRIGOUT;
    volatile    uint32_t    RESERVED67[2];
    volatile    uint32_t    ITCHIN;
    volatile    uint32_t    RESERVED68[2];
    volatile    uint32_t    ITCTRL;
    volatile    uint32_t    RESERVED69[46];
    volatile    uint32_t    DEVARCH;
    volatile    uint32_t    RESERVED70[2];
    volatile    uint32_t    DEVID;
    volatile    uint32_t    DEVTYPE;
    volatile    uint32_t    PIDR4;
    volatile    uint32_t    PIDR5;
    volatile    uint32_t    PIDR6;
    volatile    uint32_t    PIDR7;
    volatile    uint32_t    PIDR0;
    volatile    uint32_t    PIDR1;
    volatile    uint32_t    PIDR2;
    volatile    uint32_t    PIDR3;
    volatile    uint32_t    CIDR0;
    volatile    uint32_t    CIDR1;
    volatile    uint32_t    CIDR2;
    volatile    uint32_t    CIDR3;
} PPB_TypeDef;

#ifdef __cplusplus
#define PPB_NS  reinterpret_cast<PPB_TypeDef *>(0xE0020000U)
#define PPB_S   reinterpret_cast<PPB_TypeDef *>(0xE0000000U)
#else
#define PPB_NS  ((PPB_TypeDef *)0xE0020000U)
#define PPB_S   ((PPB_TypeDef *)0xE0000000U)
#endif

// ITM_STIM0 Configuration

