Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_ppb.h
#define PPB_ITM_STIM0_STIMULUS                  (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM0_STIMULUS_0                (0x1U<<0)

// ITM_STIM1 Configuration

#define PPB_ITM_STIM1_STIMULUS                  (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM1_STIMULUS_0                (0x1U<<0)

// ITM_STIM2 Configuration

#define PPB_ITM_STIM2_STIMULUS                  (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM2_STIMULUS_0                (0x1U<<0)

// ITM_STIM3 Configuration

#define PPB_ITM_STIM3_STIMULUS                  (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM3_STIMULUS_0                (0x1U<<0)

// ITM_STIM4 Configuration

#define PPB_ITM_STIM4_STIMULUS                  (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM4_STIMULUS_0                (0x1U<<0)

// ITM_STIM5 Configuration

#define PPB_ITM_STIM5_STIMULUS                  (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM5_STIMULUS_0                (0x1U<<0)

// ITM_STIM6 Configuration

#define PPB_ITM_STIM6_STIMULUS                  (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM6_STIMULUS_0                (0x1U<<0)

// ITM_STIM7 Configuration

#define PPB_ITM_STIM7_STIMULUS                  (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM7_STIMULUS_0                (0x1U<<0)

// ITM_STIM8 Configuration

#define PPB_ITM_STIM8_STIMULUS                  (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM8_STIMULUS_0                (0x1U<<0)

// ITM_STIM9 Configuration

#define PPB_ITM_STIM9_STIMULUS                  (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM9_STIMULUS_0                (0x1U<<0)

// ITM_STIM10 Configuration

#define PPB_ITM_STIM10_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM10_STIMULUS_0               (0x1U<<0)

// ITM_STIM11 Configuration

#define PPB_ITM_STIM11_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM11_STIMULUS_0               (0x1U<<0)

// ITM_STIM12 Configuration

#define PPB_ITM_STIM12_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM12_STIMULUS_0               (0x1U<<0)

// ITM_STIM13 Configuration

#define PPB_ITM_STIM13_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM13_STIMULUS_0               (0x1U<<0)

// ITM_STIM14 Configuration

#define PPB_ITM_STIM14_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM14_STIMULUS_0               (0x1U<<0)

// ITM_STIM15 Configuration

#define PPB_ITM_STIM15_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM15_STIMULUS_0               (0x1U<<0)

// ITM_STIM16 Configuration

#define PPB_ITM_STIM16_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM16_STIMULUS_0               (0x1U<<0)

// ITM_STIM17 Configuration

#define PPB_ITM_STIM17_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM17_STIMULUS_0               (0x1U<<0)

// ITM_STIM18 Configuration

#define PPB_ITM_STIM18_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM18_STIMULUS_0               (0x1U<<0)

// ITM_STIM19 Configuration

#define PPB_ITM_STIM19_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM19_STIMULUS_0               (0x1U<<0)

// ITM_STIM20 Configuration

#define PPB_ITM_STIM20_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM20_STIMULUS_0               (0x1U<<0)

// ITM_STIM21 Configuration

#define PPB_ITM_STIM21_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM21_STIMULUS_0               (0x1U<<0)

// ITM_STIM22 Configuration

#define PPB_ITM_STIM22_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM22_STIMULUS_0               (0x1U<<0)

// ITM_STIM23 Configuration

#define PPB_ITM_STIM23_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM23_STIMULUS_0               (0x1U<<0)

// ITM_STIM24 Configuration

#define PPB_ITM_STIM24_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM24_STIMULUS_0               (0x1U<<0)

// ITM_STIM25 Configuration

#define PPB_ITM_STIM25_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM25_STIMULUS_0               (0x1U<<0)

// ITM_STIM26 Configuration

#define PPB_ITM_STIM26_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM26_STIMULUS_0               (0x1U<<0)

// ITM_STIM27 Configuration

#define PPB_ITM_STIM27_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM27_STIMULUS_0               (0x1U<<0)

// ITM_STIM28 Configuration

#define PPB_ITM_STIM28_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM28_STIMULUS_0               (0x1U<<0)

// ITM_STIM29 Configuration

#define PPB_ITM_STIM29_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM29_STIMULUS_0               (0x1U<<0)

// ITM_STIM30 Configuration

#define PPB_ITM_STIM30_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM30_STIMULUS_0               (0x1U<<0)

// ITM_STIM31 Configuration

#define PPB_ITM_STIM31_STIMULUS                 (0xFFFFFFFFU<<0)
#define PPB_ITM_STIM31_STIMULUS_0               (0x1U<<0)

// ITM_TER0 Configuration

#define PPB_ITM_TER0_STIMENA                    (0xFFFFFFFFU<<0)
#define PPB_ITM_TER0_STIMENA_0                  (0x1U<<0)

// ITM_TPR Configuration

#define PPB_ITM_TPR_PRIVMASK                    (0xFU<<0)
#define PPB_ITM_TPR_PRIVMASK_0                  (0x1U<<0)

// ITM_TCR Configuration

#define PPB_ITM_TCR_ITMENA                      (0x1U<<0)
#define PPB_ITM_TCR_TSENA                       (0x1U<<1)
#define PPB_ITM_TCR_SYNCENA                     (0x1U<<2)
#define PPB_ITM_TCR_TXENA                       (0x1U<<3)
#define PPB_ITM_TCR_SWOENA                      (0x1U<<4)
#define PPB_ITM_TCR_STALLENA                    (0x1U<<5)
#define PPB_ITM_TCR_TSPRESCALE                  (0x3U<<8)
#define PPB_ITM_TCR_TSPRESCALE_0                (0x1U<<8)
#define PPB_ITM_TCR_GTSFREQ                     (0x3U<<10)
#define PPB_ITM_TCR_GTSFREQ_0                   (0x1U<<10)
#define PPB_ITM_TCR_TRACEBUSID                  (0x7FU<<16)
#define PPB_ITM_TCR_TRACEBUSID_0                (0x1U<<16)
#define PPB_ITM_TCR_BUSY                        (0x1U<<23)

// INT_ATREADY Configuration

#define PPB_INT_ATREADY_ATREADY                 (0x1U<<0)
#define PPB_INT_ATREADY_AFVALID                 (0x1U<<1)

// INT_ATVALID Configuration

#define PPB_INT_ATVALID_ATREADY                 (0x1U<<0)
#define PPB_INT_ATVALID_AFREADY                 (0x1U<<1)

// ITM_ITCTRL Configuration

#define PPB_ITM_ITCTRL_IME                      (0x1U<<0)

// ITM_DEVARCH Configuration

