Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_ppb.h
#define PPB_ITM_DEVARCH_ARCHPART                (0xFFFU<<0)
#define PPB_ITM_DEVARCH_ARCHPART_0              (0x1U<<0)
#define PPB_ITM_DEVARCH_ARCHVER                 (0xFU<<12)
#define PPB_ITM_DEVARCH_ARCHVER_0               (0x1U<<12)
#define PPB_ITM_DEVARCH_REVISION                (0xFU<<16)
#define PPB_ITM_DEVARCH_REVISION_0              (0x1U<<16)
#define PPB_ITM_DEVARCH_PRESENT                 (0x1U<<20)
#define PPB_ITM_DEVARCH_ARCHITECT               (0x7FFU<<21)
#define PPB_ITM_DEVARCH_ARCHITECT_0             (0x1U<<21)

// ITM_DEVTYPE Configuration

#define PPB_ITM_DEVTYPE_MAJOR                   (0xFU<<0)
#define PPB_ITM_DEVTYPE_MAJOR_0                 (0x1U<<0)
#define PPB_ITM_DEVTYPE_SUB                     (0xFU<<4)
#define PPB_ITM_DEVTYPE_SUB_0                   (0x1U<<4)

// ITM_PIDR4 Configuration

#define PPB_ITM_PIDR4_DES_2                     (0xFU<<0)
#define PPB_ITM_PIDR4_DES_2_0                   (0x1U<<0)
#define PPB_ITM_PIDR4_SIZE                      (0xFU<<4)
#define PPB_ITM_PIDR4_SIZE_0                    (0x1U<<4)

// ITM_PIDR5 Configuration

#define PPB_ITM_PIDR5_ITM_PIDR5                 (0xFFFFFFFFU<<0)
#define PPB_ITM_PIDR5_ITM_PIDR5_0               (0x1U<<0)

// ITM_PIDR6 Configuration

#define PPB_ITM_PIDR6_ITM_PIDR6                 (0xFFFFFFFFU<<0)
#define PPB_ITM_PIDR6_ITM_PIDR6_0               (0x1U<<0)

// ITM_PIDR7 Configuration

#define PPB_ITM_PIDR7_ITM_PIDR7                 (0xFFFFFFFFU<<0)
#define PPB_ITM_PIDR7_ITM_PIDR7_0               (0x1U<<0)

// ITM_PIDR0 Configuration

#define PPB_ITM_PIDR0_PART_0                    (0xFFU<<0)
#define PPB_ITM_PIDR0_PART_0_0                  (0x1U<<0)

// ITM_PIDR1 Configuration

#define PPB_ITM_PIDR1_PART_1                    (0xFU<<0)
#define PPB_ITM_PIDR1_PART_1_0                  (0x1U<<0)
#define PPB_ITM_PIDR1_DES_0                     (0xFU<<4)
#define PPB_ITM_PIDR1_DES_0_0                   (0x1U<<4)

// ITM_PIDR2 Configuration

#define PPB_ITM_PIDR2_DES_1                     (0x7U<<0)
#define PPB_ITM_PIDR2_DES_1_0                   (0x1U<<0)
#define PPB_ITM_PIDR2_JEDEC                     (0x1U<<3)
#define PPB_ITM_PIDR2_REVISION                  (0xFU<<4)
#define PPB_ITM_PIDR2_REVISION_0                (0x1U<<4)

// ITM_PIDR3 Configuration

#define PPB_ITM_PIDR3_CMOD                      (0xFU<<0)
#define PPB_ITM_PIDR3_CMOD_0                    (0x1U<<0)
#define PPB_ITM_PIDR3_REVAND                    (0xFU<<4)
#define PPB_ITM_PIDR3_REVAND_0                  (0x1U<<4)

// ITM_CIDR0 Configuration

#define PPB_ITM_CIDR0_PRMBL_0                   (0xFFU<<0)
#define PPB_ITM_CIDR0_PRMBL_0_0                 (0x1U<<0)

// ITM_CIDR1 Configuration

#define PPB_ITM_CIDR1_PRMBL_1                   (0xFU<<0)
#define PPB_ITM_CIDR1_PRMBL_1_0                 (0x1U<<0)
#define PPB_ITM_CIDR1_CLASS                     (0xFU<<4)
#define PPB_ITM_CIDR1_CLASS_0                   (0x1U<<4)

// ITM_CIDR2 Configuration

#define PPB_ITM_CIDR2_PRMBL_2                   (0xFFU<<0)
#define PPB_ITM_CIDR2_PRMBL_2_0                 (0x1U<<0)

// ITM_CIDR3 Configuration

#define PPB_ITM_CIDR3_PRMBL_3                   (0xFFU<<0)
#define PPB_ITM_CIDR3_PRMBL_3_0                 (0x1U<<0)

// DWT_CTRL Configuration

#define PPB_DWT_CTRL_CYCCNTENA                  (0x1U<<0)
#define PPB_DWT_CTRL_POSTPRESET                 (0xFU<<1)
#define PPB_DWT_CTRL_POSTPRESET_0               (0x1U<<1)
#define PPB_DWT_CTRL_POSTINIT                   (0xFU<<5)
#define PPB_DWT_CTRL_POSTINIT_0                 (0x1U<<5)
#define PPB_DWT_CTRL_CYCTAP                     (0x1U<<9)
#define PPB_DWT_CTRL_SYNCTAP                    (0x3U<<10)
#define PPB_DWT_CTRL_SYNCTAP_0                  (0x1U<<10)
#define PPB_DWT_CTRL_PCSAMPLENA                 (0x1U<<12)
#define PPB_DWT_CTRL_EXTTRCENA                  (0x1U<<16)
#define PPB_DWT_CTRL_CPIEVTENA                  (0x1U<<17)
#define PPB_DWT_CTRL_EXCEVTENA                  (0x1U<<18)
#define PPB_DWT_CTRL_SLEEPEVTENA                (0x1U<<19)
#define PPB_DWT_CTRL_LSUEVTENA                  (0x1U<<20)
#define PPB_DWT_CTRL_FOLDEVTENA                 (0x1U<<21)
#define PPB_DWT_CTRL_CYCEVTENA                  (0x1U<<22)
#define PPB_DWT_CTRL_CYCDISS                    (0x1U<<23)
#define PPB_DWT_CTRL_NOPRFCNT                   (0x1U<<24)
#define PPB_DWT_CTRL_NOCYCCNT                   (0x1U<<25)
#define PPB_DWT_CTRL_NOEXTTRIG                  (0x1U<<26)
#define PPB_DWT_CTRL_NOTRCPKT                   (0x1U<<27)
#define PPB_DWT_CTRL_NUMCOMP                    (0xFU<<28)
#define PPB_DWT_CTRL_NUMCOMP_0                  (0x1U<<28)

// DWT_CYCCNT Configuration

#define PPB_DWT_CYCCNT_CYCCNT                   (0xFFFFFFFFU<<0)
#define PPB_DWT_CYCCNT_CYCCNT_0                 (0x1U<<0)

// DWT_EXCCNT Configuration

#define PPB_DWT_EXCCNT_EXCCNT                   (0xFFU<<0)
#define PPB_DWT_EXCCNT_EXCCNT_0                 (0x1U<<0)

// DWT_LSUCNT Configuration

#define PPB_DWT_LSUCNT_LSUCNT                   (0xFFU<<0)
#define PPB_DWT_LSUCNT_LSUCNT_0                 (0x1U<<0)

// DWT_FOLDCNT Configuration

#define PPB_DWT_FOLDCNT_FOLDCNT                 (0xFFU<<0)
#define PPB_DWT_FOLDCNT_FOLDCNT_0               (0x1U<<0)

// DWT_COMP0 Configuration

#define PPB_DWT_COMP0_DWT_COMP0                 (0xFFFFFFFFU<<0)
#define PPB_DWT_COMP0_DWT_COMP0_0               (0x1U<<0)

// DWT_FUNCTION0 Configuration

#define PPB_DWT_FUNCTION0_MATCH                 (0xFU<<0)
#define PPB_DWT_FUNCTION0_MATCH_0               (0x1U<<0)
#define PPB_DWT_FUNCTION0_ACTION                (0x3U<<4)
#define PPB_DWT_FUNCTION0_ACTION_0              (0x1U<<4)
#define PPB_DWT_FUNCTION0_DATAVSIZE             (0x3U<<10)
#define PPB_DWT_FUNCTION0_DATAVSIZE_0           (0x1U<<10)
#define PPB_DWT_FUNCTION0_MATCHED               (0x1U<<24)
#define PPB_DWT_FUNCTION0_ID                    (0x1FU<<27)
#define PPB_DWT_FUNCTION0_ID_0                  (0x1U<<27)

// DWT_COMP1 Configuration

#define PPB_DWT_COMP1_DWT_COMP1                 (0xFFFFFFFFU<<0)
#define PPB_DWT_COMP1_DWT_COMP1_0               (0x1U<<0)

// DWT_FUNCTION1 Configuration

