Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_ppb.h
#define PPB_DWT_FUNCTION1_MATCH                 (0xFU<<0)
#define PPB_DWT_FUNCTION1_MATCH_0               (0x1U<<0)
#define PPB_DWT_FUNCTION1_ACTION                (0x3U<<4)
#define PPB_DWT_FUNCTION1_ACTION_0              (0x1U<<4)
#define PPB_DWT_FUNCTION1_DATAVSIZE             (0x3U<<10)
#define PPB_DWT_FUNCTION1_DATAVSIZE_0           (0x1U<<10)
#define PPB_DWT_FUNCTION1_MATCHED               (0x1U<<24)
#define PPB_DWT_FUNCTION1_ID                    (0x1FU<<27)
#define PPB_DWT_FUNCTION1_ID_0                  (0x1U<<27)

// DWT_COMP2 Configuration

#define PPB_DWT_COMP2_DWT_COMP2                 (0xFFFFFFFFU<<0)
#define PPB_DWT_COMP2_DWT_COMP2_0               (0x1U<<0)

// DWT_FUNCTION2 Configuration

#define PPB_DWT_FUNCTION2_MATCH                 (0xFU<<0)
#define PPB_DWT_FUNCTION2_MATCH_0               (0x1U<<0)
#define PPB_DWT_FUNCTION2_ACTION                (0x3U<<4)
#define PPB_DWT_FUNCTION2_ACTION_0              (0x1U<<4)
#define PPB_DWT_FUNCTION2_DATAVSIZE             (0x3U<<10)
#define PPB_DWT_FUNCTION2_DATAVSIZE_0           (0x1U<<10)
#define PPB_DWT_FUNCTION2_MATCHED               (0x1U<<24)
#define PPB_DWT_FUNCTION2_ID                    (0x1FU<<27)
#define PPB_DWT_FUNCTION2_ID_0                  (0x1U<<27)

// DWT_COMP3 Configuration

#define PPB_DWT_COMP3_DWT_COMP3                 (0xFFFFFFFFU<<0)
#define PPB_DWT_COMP3_DWT_COMP3_0               (0x1U<<0)

// DWT_FUNCTION3 Configuration

#define PPB_DWT_FUNCTION3_MATCH                 (0xFU<<0)
#define PPB_DWT_FUNCTION3_MATCH_0               (0x1U<<0)
#define PPB_DWT_FUNCTION3_ACTION                (0x3U<<4)
#define PPB_DWT_FUNCTION3_ACTION_0              (0x1U<<4)
#define PPB_DWT_FUNCTION3_DATAVSIZE             (0x3U<<10)
#define PPB_DWT_FUNCTION3_DATAVSIZE_0           (0x1U<<10)
#define PPB_DWT_FUNCTION3_MATCHED               (0x1U<<24)
#define PPB_DWT_FUNCTION3_ID                    (0x1FU<<27)
#define PPB_DWT_FUNCTION3_ID_0                  (0x1U<<27)

// DWT_DEVARCH Configuration

#define PPB_DWT_DEVARCH_ARCHPART                (0xFFFU<<0)
#define PPB_DWT_DEVARCH_ARCHPART_0              (0x1U<<0)
#define PPB_DWT_DEVARCH_ARCHVER                 (0xFU<<12)
#define PPB_DWT_DEVARCH_ARCHVER_0               (0x1U<<12)
#define PPB_DWT_DEVARCH_REVISION                (0xFU<<16)
#define PPB_DWT_DEVARCH_REVISION_0              (0x1U<<16)
#define PPB_DWT_DEVARCH_PRESENT                 (0x1U<<20)
#define PPB_DWT_DEVARCH_ARCHITECT               (0x7FFU<<21)
#define PPB_DWT_DEVARCH_ARCHITECT_0             (0x1U<<21)

// DWT_DEVTYPE Configuration

#define PPB_DWT_DEVTYPE_MAJOR                   (0xFU<<0)
#define PPB_DWT_DEVTYPE_MAJOR_0                 (0x1U<<0)
#define PPB_DWT_DEVTYPE_SUB                     (0xFU<<4)
#define PPB_DWT_DEVTYPE_SUB_0                   (0x1U<<4)

// DWT_PIDR4 Configuration

#define PPB_DWT_PIDR4_DES_2                     (0xFU<<0)
#define PPB_DWT_PIDR4_DES_2_0                   (0x1U<<0)
#define PPB_DWT_PIDR4_SIZE                      (0xFU<<4)
#define PPB_DWT_PIDR4_SIZE_0                    (0x1U<<4)

// DWT_PIDR5 Configuration

#define PPB_DWT_PIDR5_DWT_PIDR5                 (0xFFFFFFFFU<<0)
#define PPB_DWT_PIDR5_DWT_PIDR5_0               (0x1U<<0)

// DWT_PIDR6 Configuration

#define PPB_DWT_PIDR6_DWT_PIDR6                 (0xFFFFFFFFU<<0)
#define PPB_DWT_PIDR6_DWT_PIDR6_0               (0x1U<<0)

// DWT_PIDR7 Configuration

#define PPB_DWT_PIDR7_DWT_PIDR7                 (0xFFFFFFFFU<<0)
#define PPB_DWT_PIDR7_DWT_PIDR7_0               (0x1U<<0)

// DWT_PIDR0 Configuration

#define PPB_DWT_PIDR0_PART_0                    (0xFFU<<0)
#define PPB_DWT_PIDR0_PART_0_0                  (0x1U<<0)

// DWT_PIDR1 Configuration

#define PPB_DWT_PIDR1_PART_1                    (0xFU<<0)
#define PPB_DWT_PIDR1_PART_1_0                  (0x1U<<0)
#define PPB_DWT_PIDR1_DES_0                     (0xFU<<4)
#define PPB_DWT_PIDR1_DES_0_0                   (0x1U<<4)

// DWT_PIDR2 Configuration

#define PPB_DWT_PIDR2_DES_1                     (0x7U<<0)
#define PPB_DWT_PIDR2_DES_1_0                   (0x1U<<0)
#define PPB_DWT_PIDR2_JEDEC                     (0x1U<<3)
#define PPB_DWT_PIDR2_REVISION                  (0xFU<<4)
#define PPB_DWT_PIDR2_REVISION_0                (0x1U<<4)

// DWT_PIDR3 Configuration

#define PPB_DWT_PIDR3_CMOD                      (0xFU<<0)
#define PPB_DWT_PIDR3_CMOD_0                    (0x1U<<0)
#define PPB_DWT_PIDR3_REVAND                    (0xFU<<4)
#define PPB_DWT_PIDR3_REVAND_0                  (0x1U<<4)

// DWT_CIDR0 Configuration

#define PPB_DWT_CIDR0_PRMBL_0                   (0xFFU<<0)
#define PPB_DWT_CIDR0_PRMBL_0_0                 (0x1U<<0)

// DWT_CIDR1 Configuration

#define PPB_DWT_CIDR1_PRMBL_1                   (0xFU<<0)
#define PPB_DWT_CIDR1_PRMBL_1_0                 (0x1U<<0)
#define PPB_DWT_CIDR1_CLASS                     (0xFU<<4)
#define PPB_DWT_CIDR1_CLASS_0                   (0x1U<<4)

// DWT_CIDR2 Configuration

#define PPB_DWT_CIDR2_PRMBL_2                   (0xFFU<<0)
#define PPB_DWT_CIDR2_PRMBL_2_0                 (0x1U<<0)

// DWT_CIDR3 Configuration

#define PPB_DWT_CIDR3_PRMBL_3                   (0xFFU<<0)
#define PPB_DWT_CIDR3_PRMBL_3_0                 (0x1U<<0)

// FP_CTRL Configuration

#define PPB_FP_CTRL_ENABLE                      (0x1U<<0)
#define PPB_FP_CTRL_KEY                         (0x1U<<1)
#define PPB_FP_CTRL_NUM_CODE_7_4_               (0xFU<<4)
#define PPB_FP_CTRL_NUM_CODE_7_4__0             (0x1U<<4)
#define PPB_FP_CTRL_NUM_LIT                     (0xFU<<8)
#define PPB_FP_CTRL_NUM_LIT_0                   (0x1U<<8)
#define PPB_FP_CTRL_NUM_CODE_14_12_             (0x7U<<12)
#define PPB_FP_CTRL_NUM_CODE_14_12__0           (0x1U<<12)
#define PPB_FP_CTRL_REV                         (0xFU<<28)
#define PPB_FP_CTRL_REV_0                       (0x1U<<28)

// FP_REMAP Configuration

#define PPB_FP_REMAP_REMAP                      (0xFFFFFFU<<5)
#define PPB_FP_REMAP_REMAP_0                    (0x1U<<5)
#define PPB_FP_REMAP_RMPSPT                     (0x1U<<29)

// FP_COMP0 Configuration

#define PPB_FP_COMP0_BE                         (0x1U<<0)

// FP_COMP1 Configuration

#define PPB_FP_COMP1_BE                         (0x1U<<0)

