Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_ppb.h
// FP_COMP2 Configuration

#define PPB_FP_COMP2_BE                         (0x1U<<0)

// FP_COMP3 Configuration

#define PPB_FP_COMP3_BE                         (0x1U<<0)

// FP_COMP4 Configuration

#define PPB_FP_COMP4_BE                         (0x1U<<0)

// FP_COMP5 Configuration

#define PPB_FP_COMP5_BE                         (0x1U<<0)

// FP_COMP6 Configuration

#define PPB_FP_COMP6_BE                         (0x1U<<0)

// FP_COMP7 Configuration

#define PPB_FP_COMP7_BE                         (0x1U<<0)

// FP_DEVARCH Configuration

#define PPB_FP_DEVARCH_ARCHPART                 (0xFFFU<<0)
#define PPB_FP_DEVARCH_ARCHPART_0               (0x1U<<0)
#define PPB_FP_DEVARCH_ARCHVER                  (0xFU<<12)
#define PPB_FP_DEVARCH_ARCHVER_0                (0x1U<<12)
#define PPB_FP_DEVARCH_REVISION                 (0xFU<<16)
#define PPB_FP_DEVARCH_REVISION_0               (0x1U<<16)
#define PPB_FP_DEVARCH_PRESENT                  (0x1U<<20)
#define PPB_FP_DEVARCH_ARCHITECT                (0x7FFU<<21)
#define PPB_FP_DEVARCH_ARCHITECT_0              (0x1U<<21)

// FP_DEVTYPE Configuration

#define PPB_FP_DEVTYPE_MAJOR                    (0xFU<<0)
#define PPB_FP_DEVTYPE_MAJOR_0                  (0x1U<<0)
#define PPB_FP_DEVTYPE_SUB                      (0xFU<<4)
#define PPB_FP_DEVTYPE_SUB_0                    (0x1U<<4)

// FP_PIDR4 Configuration

#define PPB_FP_PIDR4_DES_2                      (0xFU<<0)
#define PPB_FP_PIDR4_DES_2_0                    (0x1U<<0)
#define PPB_FP_PIDR4_SIZE                       (0xFU<<4)
#define PPB_FP_PIDR4_SIZE_0                     (0x1U<<4)

// FP_PIDR5 Configuration

#define PPB_FP_PIDR5_FP_PIDR5                   (0xFFFFFFFFU<<0)
#define PPB_FP_PIDR5_FP_PIDR5_0                 (0x1U<<0)

// FP_PIDR6 Configuration

#define PPB_FP_PIDR6_FP_PIDR6                   (0xFFFFFFFFU<<0)
#define PPB_FP_PIDR6_FP_PIDR6_0                 (0x1U<<0)

// FP_PIDR7 Configuration

#define PPB_FP_PIDR7_FP_PIDR7                   (0xFFFFFFFFU<<0)
#define PPB_FP_PIDR7_FP_PIDR7_0                 (0x1U<<0)

// FP_PIDR0 Configuration

#define PPB_FP_PIDR0_PART_0                     (0xFFU<<0)
#define PPB_FP_PIDR0_PART_0_0                   (0x1U<<0)

// FP_PIDR1 Configuration

#define PPB_FP_PIDR1_PART_1                     (0xFU<<0)
#define PPB_FP_PIDR1_PART_1_0                   (0x1U<<0)
#define PPB_FP_PIDR1_DES_0                      (0xFU<<4)
#define PPB_FP_PIDR1_DES_0_0                    (0x1U<<4)

// FP_PIDR2 Configuration

#define PPB_FP_PIDR2_DES_1                      (0x7U<<0)
#define PPB_FP_PIDR2_DES_1_0                    (0x1U<<0)
#define PPB_FP_PIDR2_JEDEC                      (0x1U<<3)
#define PPB_FP_PIDR2_REVISION                   (0xFU<<4)
#define PPB_FP_PIDR2_REVISION_0                 (0x1U<<4)

// FP_PIDR3 Configuration

#define PPB_FP_PIDR3_CMOD                       (0xFU<<0)
#define PPB_FP_PIDR3_CMOD_0                     (0x1U<<0)
#define PPB_FP_PIDR3_REVAND                     (0xFU<<4)
#define PPB_FP_PIDR3_REVAND_0                   (0x1U<<4)

// FP_CIDR0 Configuration

#define PPB_FP_CIDR0_PRMBL_0                    (0xFFU<<0)
#define PPB_FP_CIDR0_PRMBL_0_0                  (0x1U<<0)

// FP_CIDR1 Configuration

#define PPB_FP_CIDR1_PRMBL_1                    (0xFU<<0)
#define PPB_FP_CIDR1_PRMBL_1_0                  (0x1U<<0)
#define PPB_FP_CIDR1_CLASS                      (0xFU<<4)
#define PPB_FP_CIDR1_CLASS_0                    (0x1U<<4)

// FP_CIDR2 Configuration

#define PPB_FP_CIDR2_PRMBL_2                    (0xFFU<<0)
#define PPB_FP_CIDR2_PRMBL_2_0                  (0x1U<<0)

// FP_CIDR3 Configuration

#define PPB_FP_CIDR3_PRMBL_3                    (0xFFU<<0)
#define PPB_FP_CIDR3_PRMBL_3_0                  (0x1U<<0)

// ICTR Configuration

#define PPB_ICTR_INTLINESNUM                    (0xFU<<0)
#define PPB_ICTR_INTLINESNUM_0                  (0x1U<<0)

// ACTLR Configuration

#define PPB_ACTLR_DISMCYCINT                    (0x1U<<0)
#define PPB_ACTLR_DISFOLD                       (0x1U<<2)
#define PPB_ACTLR_DISOOFP                       (0x1U<<9)
#define PPB_ACTLR_FPEXCODIS                     (0x1U<<10)
#define PPB_ACTLR_DISITMATBFLUSH                (0x1U<<12)
#define PPB_ACTLR_EXTEXCLALL                    (0x1U<<29)

// SYST_CSR Configuration

#define PPB_SYST_CSR_ENABLE                     (0x1U<<0)
#define PPB_SYST_CSR_TICKINT                    (0x1U<<1)
#define PPB_SYST_CSR_CLKSOURCE                  (0x1U<<2)
#define PPB_SYST_CSR_COUNTFLAG                  (0x1U<<16)

// SYST_RVR Configuration

#define PPB_SYST_RVR_RELOAD                     (0xFFFFFFU<<0)
#define PPB_SYST_RVR_RELOAD_0                   (0x1U<<0)

// SYST_CVR Configuration

#define PPB_SYST_CVR_CURRENT                    (0xFFFFFFU<<0)
#define PPB_SYST_CVR_CURRENT_0                  (0x1U<<0)

// SYST_CALIB Configuration

#define PPB_SYST_CALIB_TENMS                    (0xFFFFFFU<<0)
#define PPB_SYST_CALIB_TENMS_0                  (0x1U<<0)
#define PPB_SYST_CALIB_SKEW                     (0x1U<<30)
#define PPB_SYST_CALIB_NOREF                    (0x1U<<31)

// NVIC_ISER0 Configuration

#define PPB_NVIC_ISER0_SETENA                   (0xFFFFFFFFU<<0)
#define PPB_NVIC_ISER0_SETENA_0                 (0x1U<<0)

// NVIC_ISER1 Configuration

#define PPB_NVIC_ISER1_SETENA                   (0xFFFFFFFFU<<0)
#define PPB_NVIC_ISER1_SETENA_0                 (0x1U<<0)

// NVIC_ICER0 Configuration

#define PPB_NVIC_ICER0_CLRENA                   (0xFFFFFFFFU<<0)
#define PPB_NVIC_ICER0_CLRENA_0                 (0x1U<<0)

// NVIC_ICER1 Configuration

#define PPB_NVIC_ICER1_CLRENA                   (0xFFFFFFFFU<<0)
#define PPB_NVIC_ICER1_CLRENA_0                 (0x1U<<0)

// NVIC_ISPR0 Configuration

#define PPB_NVIC_ISPR0_SETPEND                  (0xFFFFFFFFU<<0)
#define PPB_NVIC_ISPR0_SETPEND_0                (0x1U<<0)

// NVIC_ISPR1 Configuration

#define PPB_NVIC_ISPR1_SETPEND                  (0xFFFFFFFFU<<0)
#define PPB_NVIC_ISPR1_SETPEND_0                (0x1U<<0)

// NVIC_ICPR0 Configuration

#define PPB_NVIC_ICPR0_CLRPEND                  (0xFFFFFFFFU<<0)
#define PPB_NVIC_ICPR0_CLRPEND_0                (0x1U<<0)

