Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_ppb.h
// NVIC_ICPR1 Configuration

#define PPB_NVIC_ICPR1_CLRPEND                  (0xFFFFFFFFU<<0)
#define PPB_NVIC_ICPR1_CLRPEND_0                (0x1U<<0)

// NVIC_IABR0 Configuration

#define PPB_NVIC_IABR0_ACTIVE                   (0xFFFFFFFFU<<0)
#define PPB_NVIC_IABR0_ACTIVE_0                 (0x1U<<0)

// NVIC_IABR1 Configuration

#define PPB_NVIC_IABR1_ACTIVE                   (0xFFFFFFFFU<<0)
#define PPB_NVIC_IABR1_ACTIVE_0                 (0x1U<<0)

// NVIC_ITNS0 Configuration

#define PPB_NVIC_ITNS0_ITNS                     (0xFFFFFFFFU<<0)
#define PPB_NVIC_ITNS0_ITNS_0                   (0x1U<<0)

// NVIC_ITNS1 Configuration

#define PPB_NVIC_ITNS1_ITNS                     (0xFFFFFFFFU<<0)
#define PPB_NVIC_ITNS1_ITNS_0                   (0x1U<<0)

// NVIC_IPR0 Configuration

#define PPB_NVIC_IPR0_PRI_N0                    (0xFU<<4)
#define PPB_NVIC_IPR0_PRI_N0_0                  (0x1U<<4)
#define PPB_NVIC_IPR0_PRI_N1                    (0xFU<<12)
#define PPB_NVIC_IPR0_PRI_N1_0                  (0x1U<<12)
#define PPB_NVIC_IPR0_PRI_N2                    (0xFU<<20)
#define PPB_NVIC_IPR0_PRI_N2_0                  (0x1U<<20)
#define PPB_NVIC_IPR0_PRI_N3                    (0xFU<<28)
#define PPB_NVIC_IPR0_PRI_N3_0                  (0x1U<<28)

// NVIC_IPR1 Configuration

#define PPB_NVIC_IPR1_PRI_N0                    (0xFU<<4)
#define PPB_NVIC_IPR1_PRI_N0_0                  (0x1U<<4)
#define PPB_NVIC_IPR1_PRI_N1                    (0xFU<<12)
#define PPB_NVIC_IPR1_PRI_N1_0                  (0x1U<<12)
#define PPB_NVIC_IPR1_PRI_N2                    (0xFU<<20)
#define PPB_NVIC_IPR1_PRI_N2_0                  (0x1U<<20)
#define PPB_NVIC_IPR1_PRI_N3                    (0xFU<<28)
#define PPB_NVIC_IPR1_PRI_N3_0                  (0x1U<<28)

// NVIC_IPR2 Configuration

#define PPB_NVIC_IPR2_PRI_N0                    (0xFU<<4)
#define PPB_NVIC_IPR2_PRI_N0_0                  (0x1U<<4)
#define PPB_NVIC_IPR2_PRI_N1                    (0xFU<<12)
#define PPB_NVIC_IPR2_PRI_N1_0                  (0x1U<<12)
#define PPB_NVIC_IPR2_PRI_N2                    (0xFU<<20)
#define PPB_NVIC_IPR2_PRI_N2_0                  (0x1U<<20)
#define PPB_NVIC_IPR2_PRI_N3                    (0xFU<<28)
#define PPB_NVIC_IPR2_PRI_N3_0                  (0x1U<<28)

// NVIC_IPR3 Configuration

#define PPB_NVIC_IPR3_PRI_N0                    (0xFU<<4)
#define PPB_NVIC_IPR3_PRI_N0_0                  (0x1U<<4)
#define PPB_NVIC_IPR3_PRI_N1                    (0xFU<<12)
#define PPB_NVIC_IPR3_PRI_N1_0                  (0x1U<<12)
#define PPB_NVIC_IPR3_PRI_N2                    (0xFU<<20)
#define PPB_NVIC_IPR3_PRI_N2_0                  (0x1U<<20)
#define PPB_NVIC_IPR3_PRI_N3                    (0xFU<<28)
#define PPB_NVIC_IPR3_PRI_N3_0                  (0x1U<<28)

// NVIC_IPR4 Configuration

#define PPB_NVIC_IPR4_PRI_N0                    (0xFU<<4)
#define PPB_NVIC_IPR4_PRI_N0_0                  (0x1U<<4)
#define PPB_NVIC_IPR4_PRI_N1                    (0xFU<<12)
#define PPB_NVIC_IPR4_PRI_N1_0                  (0x1U<<12)
#define PPB_NVIC_IPR4_PRI_N2                    (0xFU<<20)
#define PPB_NVIC_IPR4_PRI_N2_0                  (0x1U<<20)
#define PPB_NVIC_IPR4_PRI_N3                    (0xFU<<28)
#define PPB_NVIC_IPR4_PRI_N3_0                  (0x1U<<28)

// NVIC_IPR5 Configuration

#define PPB_NVIC_IPR5_PRI_N0                    (0xFU<<4)
#define PPB_NVIC_IPR5_PRI_N0_0                  (0x1U<<4)
#define PPB_NVIC_IPR5_PRI_N1                    (0xFU<<12)
#define PPB_NVIC_IPR5_PRI_N1_0                  (0x1U<<12)
#define PPB_NVIC_IPR5_PRI_N2                    (0xFU<<20)
#define PPB_NVIC_IPR5_PRI_N2_0                  (0x1U<<20)
#define PPB_NVIC_IPR5_PRI_N3                    (0xFU<<28)
#define PPB_NVIC_IPR5_PRI_N3_0                  (0x1U<<28)

// NVIC_IPR6 Configuration

#define PPB_NVIC_IPR6_PRI_N0                    (0xFU<<4)
#define PPB_NVIC_IPR6_PRI_N0_0                  (0x1U<<4)
#define PPB_NVIC_IPR6_PRI_N1                    (0xFU<<12)
#define PPB_NVIC_IPR6_PRI_N1_0                  (0x1U<<12)
#define PPB_NVIC_IPR6_PRI_N2                    (0xFU<<20)
#define PPB_NVIC_IPR6_PRI_N2_0                  (0x1U<<20)
#define PPB_NVIC_IPR6_PRI_N3                    (0xFU<<28)
#define PPB_NVIC_IPR6_PRI_N3_0                  (0x1U<<28)

// NVIC_IPR7 Configuration

#define PPB_NVIC_IPR7_PRI_N0                    (0xFU<<4)
#define PPB_NVIC_IPR7_PRI_N0_0                  (0x1U<<4)
#define PPB_NVIC_IPR7_PRI_N1                    (0xFU<<12)
#define PPB_NVIC_IPR7_PRI_N1_0                  (0x1U<<12)
#define PPB_NVIC_IPR7_PRI_N2                    (0xFU<<20)
#define PPB_NVIC_IPR7_PRI_N2_0                  (0x1U<<20)
#define PPB_NVIC_IPR7_PRI_N3                    (0xFU<<28)
#define PPB_NVIC_IPR7_PRI_N3_0                  (0x1U<<28)

// NVIC_IPR8 Configuration

#define PPB_NVIC_IPR8_PRI_N0                    (0xFU<<4)
#define PPB_NVIC_IPR8_PRI_N0_0                  (0x1U<<4)
#define PPB_NVIC_IPR8_PRI_N1                    (0xFU<<12)
#define PPB_NVIC_IPR8_PRI_N1_0                  (0x1U<<12)
#define PPB_NVIC_IPR8_PRI_N2                    (0xFU<<20)
#define PPB_NVIC_IPR8_PRI_N2_0                  (0x1U<<20)
#define PPB_NVIC_IPR8_PRI_N3                    (0xFU<<28)
#define PPB_NVIC_IPR8_PRI_N3_0                  (0x1U<<28)

// NVIC_IPR9 Configuration

#define PPB_NVIC_IPR9_PRI_N0                    (0xFU<<4)
#define PPB_NVIC_IPR9_PRI_N0_0                  (0x1U<<4)
#define PPB_NVIC_IPR9_PRI_N1                    (0xFU<<12)
#define PPB_NVIC_IPR9_PRI_N1_0                  (0x1U<<12)
#define PPB_NVIC_IPR9_PRI_N2                    (0xFU<<20)
#define PPB_NVIC_IPR9_PRI_N2_0                  (0x1U<<20)
#define PPB_NVIC_IPR9_PRI_N3                    (0xFU<<28)
#define PPB_NVIC_IPR9_PRI_N3_0                  (0x1U<<28)

// NVIC_IPR10 Configuration

#define PPB_NVIC_IPR10_PRI_N0                   (0xFU<<4)
#define PPB_NVIC_IPR10_PRI_N0_0                 (0x1U<<4)
#define PPB_NVIC_IPR10_PRI_N1                   (0xFU<<12)
#define PPB_NVIC_IPR10_PRI_N1_0                 (0x1U<<12)
#define PPB_NVIC_IPR10_PRI_N2                   (0xFU<<20)
#define PPB_NVIC_IPR10_PRI_N2_0                 (0x1U<<20)
#define PPB_NVIC_IPR10_PRI_N3                   (0xFU<<28)
#define PPB_NVIC_IPR10_PRI_N3_0                 (0x1U<<28)

