Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_ppb.h
// NVIC_IPR11 Configuration

#define PPB_NVIC_IPR11_PRI_N0                   (0xFU<<4)
#define PPB_NVIC_IPR11_PRI_N0_0                 (0x1U<<4)
#define PPB_NVIC_IPR11_PRI_N1                   (0xFU<<12)
#define PPB_NVIC_IPR11_PRI_N1_0                 (0x1U<<12)
#define PPB_NVIC_IPR11_PRI_N2                   (0xFU<<20)
#define PPB_NVIC_IPR11_PRI_N2_0                 (0x1U<<20)
#define PPB_NVIC_IPR11_PRI_N3                   (0xFU<<28)
#define PPB_NVIC_IPR11_PRI_N3_0                 (0x1U<<28)

// NVIC_IPR12 Configuration

#define PPB_NVIC_IPR12_PRI_N0                   (0xFU<<4)
#define PPB_NVIC_IPR12_PRI_N0_0                 (0x1U<<4)
#define PPB_NVIC_IPR12_PRI_N1                   (0xFU<<12)
#define PPB_NVIC_IPR12_PRI_N1_0                 (0x1U<<12)
#define PPB_NVIC_IPR12_PRI_N2                   (0xFU<<20)
#define PPB_NVIC_IPR12_PRI_N2_0                 (0x1U<<20)
#define PPB_NVIC_IPR12_PRI_N3                   (0xFU<<28)
#define PPB_NVIC_IPR12_PRI_N3_0                 (0x1U<<28)

// NVIC_IPR13 Configuration

#define PPB_NVIC_IPR13_PRI_N0                   (0xFU<<4)
#define PPB_NVIC_IPR13_PRI_N0_0                 (0x1U<<4)
#define PPB_NVIC_IPR13_PRI_N1                   (0xFU<<12)
#define PPB_NVIC_IPR13_PRI_N1_0                 (0x1U<<12)
#define PPB_NVIC_IPR13_PRI_N2                   (0xFU<<20)
#define PPB_NVIC_IPR13_PRI_N2_0                 (0x1U<<20)
#define PPB_NVIC_IPR13_PRI_N3                   (0xFU<<28)
#define PPB_NVIC_IPR13_PRI_N3_0                 (0x1U<<28)

// NVIC_IPR14 Configuration

#define PPB_NVIC_IPR14_PRI_N0                   (0xFU<<4)
#define PPB_NVIC_IPR14_PRI_N0_0                 (0x1U<<4)
#define PPB_NVIC_IPR14_PRI_N1                   (0xFU<<12)
#define PPB_NVIC_IPR14_PRI_N1_0                 (0x1U<<12)
#define PPB_NVIC_IPR14_PRI_N2                   (0xFU<<20)
#define PPB_NVIC_IPR14_PRI_N2_0                 (0x1U<<20)
#define PPB_NVIC_IPR14_PRI_N3                   (0xFU<<28)
#define PPB_NVIC_IPR14_PRI_N3_0                 (0x1U<<28)

// NVIC_IPR15 Configuration

#define PPB_NVIC_IPR15_PRI_N0                   (0xFU<<4)
#define PPB_NVIC_IPR15_PRI_N0_0                 (0x1U<<4)
#define PPB_NVIC_IPR15_PRI_N1                   (0xFU<<12)
#define PPB_NVIC_IPR15_PRI_N1_0                 (0x1U<<12)
#define PPB_NVIC_IPR15_PRI_N2                   (0xFU<<20)
#define PPB_NVIC_IPR15_PRI_N2_0                 (0x1U<<20)
#define PPB_NVIC_IPR15_PRI_N3                   (0xFU<<28)
#define PPB_NVIC_IPR15_PRI_N3_0                 (0x1U<<28)

// CPUID Configuration

#define PPB_CPUID_REVISION                      (0xFU<<0)
#define PPB_CPUID_REVISION_0                    (0x1U<<0)
#define PPB_CPUID_PARTNO                        (0xFFFU<<4)
#define PPB_CPUID_PARTNO_0                      (0x1U<<4)
#define PPB_CPUID_ARCHITECTURE                  (0xFU<<16)
#define PPB_CPUID_ARCHITECTURE_0                (0x1U<<16)
#define PPB_CPUID_VARIANT                       (0xFU<<20)
#define PPB_CPUID_VARIANT_0                     (0x1U<<20)
#define PPB_CPUID_IMPLEMENTER                   (0xFFU<<24)
#define PPB_CPUID_IMPLEMENTER_0                 (0x1U<<24)

// ICSR Configuration

#define PPB_ICSR_VECTACTIVE                     (0x1FFU<<0)
#define PPB_ICSR_VECTACTIVE_0                   (0x1U<<0)
#define PPB_ICSR_RETTOBASE                      (0x1U<<11)
#define PPB_ICSR_VECTPENDING                    (0x1FFU<<12)
#define PPB_ICSR_VECTPENDING_0                  (0x1U<<12)
#define PPB_ICSR_ISRPENDING                     (0x1U<<22)
#define PPB_ICSR_ISRPREEMPT                     (0x1U<<23)
#define PPB_ICSR_STTNS                          (0x1U<<24)
#define PPB_ICSR_PENDSTCLR                      (0x1U<<25)
#define PPB_ICSR_PENDSTSET                      (0x1U<<26)
#define PPB_ICSR_PENDSVCLR                      (0x1U<<27)
#define PPB_ICSR_PENDSVSET                      (0x1U<<28)
#define PPB_ICSR_PENDNMICLR                     (0x1U<<30)
#define PPB_ICSR_PENDNMISET                     (0x1U<<31)

// VTOR Configuration

#define PPB_VTOR_TBLOFF                         (0x1FFFFFFU<<7)
#define PPB_VTOR_TBLOFF_0                       (0x1U<<7)

// AIRCR Configuration

#define PPB_AIRCR_VECTCLRACTIVE                 (0x1U<<1)
#define PPB_AIRCR_SYSRESETREQ                   (0x1U<<2)
#define PPB_AIRCR_SYSRESETREQS                  (0x1U<<3)
#define PPB_AIRCR_PRIGROUP                      (0x7U<<8)
#define PPB_AIRCR_PRIGROUP_0                    (0x1U<<8)
#define PPB_AIRCR_BFHFNMINS                     (0x1U<<13)
#define PPB_AIRCR_PRIS                          (0x1U<<14)
#define PPB_AIRCR_ENDIANESS                     (0x1U<<15)
#define PPB_AIRCR_VECTKEY                       (0xFFFFU<<16)
#define PPB_AIRCR_VECTKEY_0                     (0x1U<<16)

// SCR Configuration

#define PPB_SCR_SLEEPONEXIT                     (0x1U<<1)
#define PPB_SCR_SLEEPDEEP                       (0x1U<<2)
#define PPB_SCR_SLEEPDEEPS                      (0x1U<<3)
#define PPB_SCR_SEVONPEND                       (0x1U<<4)

// CCR Configuration

#define PPB_CCR_RES1_1                          (0x1U<<0)
#define PPB_CCR_USERSETMPEND                    (0x1U<<1)
#define PPB_CCR_UNALIGN_TRP                     (0x1U<<3)
#define PPB_CCR_DIV_0_TRP                       (0x1U<<4)
#define PPB_CCR_BFHFNMIGN                       (0x1U<<8)
#define PPB_CCR_RES1                            (0x1U<<9)
#define PPB_CCR_STKOFHFNMIGN                    (0x1U<<10)
#define PPB_CCR_DC                              (0x1U<<16)
#define PPB_CCR_IC                              (0x1U<<17)
#define PPB_CCR_BP                              (0x1U<<18)

// SHPR1 Configuration

#define PPB_SHPR1_PRI_4_3                       (0x7U<<5)
#define PPB_SHPR1_PRI_4_3_0                     (0x1U<<5)
#define PPB_SHPR1_PRI_5_3                       (0x7U<<13)
#define PPB_SHPR1_PRI_5_3_0                     (0x1U<<13)
#define PPB_SHPR1_PRI_6_3                       (0x7U<<21)
#define PPB_SHPR1_PRI_6_3_0                     (0x1U<<21)
#define PPB_SHPR1_PRI_7_3                       (0x7U<<29)
#define PPB_SHPR1_PRI_7_3_0                     (0x1U<<29)

// SHPR2 Configuration

#define PPB_SHPR2_PRI_8                         (0xFFU<<0)
#define PPB_SHPR2_PRI_8_0                       (0x1U<<0)
#define PPB_SHPR2_PRI_9                         (0xFFU<<8)
#define PPB_SHPR2_PRI_9_0                       (0x1U<<8)
#define PPB_SHPR2_PRI_10                        (0xFFU<<16)
#define PPB_SHPR2_PRI_10_0                      (0x1U<<16)
#define PPB_SHPR2_PRI_11_3                      (0x7U<<29)
#define PPB_SHPR2_PRI_11_3_0                    (0x1U<<29)

// SHPR3 Configuration

#define PPB_SHPR3_PRI_12_3                      (0x7U<<5)
#define PPB_SHPR3_PRI_12_3_0                    (0x1U<<5)
#define PPB_SHPR3_PRI_13                        (0xFFU<<8)
#define PPB_SHPR3_PRI_13_0                      (0x1U<<8)
#define PPB_SHPR3_PRI_14_3                      (0x7U<<21)
#define PPB_SHPR3_PRI_14_3_0                    (0x1U<<21)
#define PPB_SHPR3_PRI_15_3                      (0x7U<<29)
#define PPB_SHPR3_PRI_15_3_0                    (0x1U<<29)

