Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_ppb.h
// SHCSR Configuration

#define PPB_SHCSR_MEMFAULTACT                   (0x1U<<0)
#define PPB_SHCSR_BUSFAULTACT                   (0x1U<<1)
#define PPB_SHCSR_HARDFAULTACT                  (0x1U<<2)
#define PPB_SHCSR_USGFAULTACT                   (0x1U<<3)
#define PPB_SHCSR_SECUREFAULTACT                (0x1U<<4)
#define PPB_SHCSR_NMIACT                        (0x1U<<5)
#define PPB_SHCSR_SVCALLACT                     (0x1U<<7)
#define PPB_SHCSR_MONITORACT                    (0x1U<<8)
#define PPB_SHCSR_PENDSVACT                     (0x1U<<10)
#define PPB_SHCSR_SYSTICKACT                    (0x1U<<11)
#define PPB_SHCSR_USGFAULTPENDED                (0x1U<<12)
#define PPB_SHCSR_MEMFAULTPENDED                (0x1U<<13)
#define PPB_SHCSR_BUSFAULTPENDED                (0x1U<<14)
#define PPB_SHCSR_SVCALLPENDED                  (0x1U<<15)
#define PPB_SHCSR_MEMFAULTENA                   (0x1U<<16)
#define PPB_SHCSR_BUSFAULTENA                   (0x1U<<17)
#define PPB_SHCSR_USGFAULTENA                   (0x1U<<18)
#define PPB_SHCSR_SECUREFAULTENA                (0x1U<<19)
#define PPB_SHCSR_SECUREFAULTPENDED             (0x1U<<20)
#define PPB_SHCSR_HARDFAULTPENDED               (0x1U<<21)

// CFSR Configuration

#define PPB_CFSR_MMFSR                          (0xFFU<<0)
#define PPB_CFSR_MMFSR_0                        (0x1U<<0)
#define PPB_CFSR_BFSR_IBUSERR                   (0x1U<<8)
#define PPB_CFSR_BFSR_PRECISERR                 (0x1U<<9)
#define PPB_CFSR_BFSR_IMPRECISERR               (0x1U<<10)
#define PPB_CFSR_BFSR_UNSTKERR                  (0x1U<<11)
#define PPB_CFSR_BFSR_STKERR                    (0x1U<<12)
#define PPB_CFSR_BFSR_LSPERR                    (0x1U<<13)
#define PPB_CFSR_BFSR_BFARVALID                 (0x1U<<15)
#define PPB_CFSR_UFSR_UNDEFINSTR                (0x1U<<16)
#define PPB_CFSR_UFSR_INVSTATE                  (0x1U<<17)
#define PPB_CFSR_UFSR_INVPC                     (0x1U<<18)
#define PPB_CFSR_UFSR_NOCP                      (0x1U<<19)
#define PPB_CFSR_UFSR_STKOF                     (0x1U<<20)
#define PPB_CFSR_UFSR_UNALIGNED                 (0x1U<<24)
#define PPB_CFSR_UFSR_DIVBYZERO                 (0x1U<<25)

// HFSR Configuration

#define PPB_HFSR_VECTTBL                        (0x1U<<1)
#define PPB_HFSR_FORCED                         (0x1U<<30)
#define PPB_HFSR_DEBUGEVT                       (0x1U<<31)

// DFSR Configuration

#define PPB_DFSR_HALTED                         (0x1U<<0)
#define PPB_DFSR_BKPT                           (0x1U<<1)
#define PPB_DFSR_DWTTRAP                        (0x1U<<2)
#define PPB_DFSR_VCATCH                         (0x1U<<3)
#define PPB_DFSR_EXTERNAL                       (0x1U<<4)

// MMFAR Configuration

#define PPB_MMFAR_ADDRESS                       (0xFFFFFFFFU<<0)
#define PPB_MMFAR_ADDRESS_0                     (0x1U<<0)

// BFAR Configuration

#define PPB_BFAR_ADDRESS                        (0xFFFFFFFFU<<0)
#define PPB_BFAR_ADDRESS_0                      (0x1U<<0)

// ID_PFR0 Configuration

#define PPB_ID_PFR0_STATE0                      (0xFU<<0)
#define PPB_ID_PFR0_STATE0_0                    (0x1U<<0)
#define PPB_ID_PFR0_STATE1                      (0xFU<<4)
#define PPB_ID_PFR0_STATE1_0                    (0x1U<<4)

// ID_PFR1 Configuration

#define PPB_ID_PFR1_SECURITY                    (0xFU<<4)
#define PPB_ID_PFR1_SECURITY_0                  (0x1U<<4)
#define PPB_ID_PFR1_MPROGMOD                    (0xFU<<8)
#define PPB_ID_PFR1_MPROGMOD_0                  (0x1U<<8)

// ID_DFR0 Configuration

#define PPB_ID_DFR0_MPROFDBG                    (0xFU<<20)
#define PPB_ID_DFR0_MPROFDBG_0                  (0x1U<<20)

// ID_AFR0 Configuration

#define PPB_ID_AFR0_IMPDEF0                     (0xFU<<0)
#define PPB_ID_AFR0_IMPDEF0_0                   (0x1U<<0)
#define PPB_ID_AFR0_IMPDEF1                     (0xFU<<4)
#define PPB_ID_AFR0_IMPDEF1_0                   (0x1U<<4)
#define PPB_ID_AFR0_IMPDEF2                     (0xFU<<8)
#define PPB_ID_AFR0_IMPDEF2_0                   (0x1U<<8)
#define PPB_ID_AFR0_IMPDEF3                     (0xFU<<12)
#define PPB_ID_AFR0_IMPDEF3_0                   (0x1U<<12)

// ID_MMFR0 Configuration

#define PPB_ID_MMFR0_PMSA                       (0xFU<<4)
#define PPB_ID_MMFR0_PMSA_0                     (0x1U<<4)
#define PPB_ID_MMFR0_OUTERSHR                   (0xFU<<8)
#define PPB_ID_MMFR0_OUTERSHR_0                 (0x1U<<8)
#define PPB_ID_MMFR0_SHARELVL                   (0xFU<<12)
#define PPB_ID_MMFR0_SHARELVL_0                 (0x1U<<12)
#define PPB_ID_MMFR0_TCM                        (0xFU<<16)
#define PPB_ID_MMFR0_TCM_0                      (0x1U<<16)
#define PPB_ID_MMFR0_AUXREG                     (0xFU<<20)
#define PPB_ID_MMFR0_AUXREG_0                   (0x1U<<20)

// ID_MMFR1 Configuration

#define PPB_ID_MMFR1_ID_MMFR1                   (0xFFFFFFFFU<<0)
#define PPB_ID_MMFR1_ID_MMFR1_0                 (0x1U<<0)

// ID_MMFR2 Configuration

#define PPB_ID_MMFR2_WFISTALL                   (0xFU<<24)
#define PPB_ID_MMFR2_WFISTALL_0                 (0x1U<<24)

// ID_MMFR3 Configuration

#define PPB_ID_MMFR3_CMAINTVA                   (0xFU<<0)
#define PPB_ID_MMFR3_CMAINTVA_0                 (0x1U<<0)
#define PPB_ID_MMFR3_CMAINTSW                   (0xFU<<4)
#define PPB_ID_MMFR3_CMAINTSW_0                 (0x1U<<4)
#define PPB_ID_MMFR3_BPMAINT                    (0xFU<<8)
#define PPB_ID_MMFR3_BPMAINT_0                  (0x1U<<8)

// ID_ISAR0 Configuration

#define PPB_ID_ISAR0_BITCOUNT                   (0xFU<<4)
#define PPB_ID_ISAR0_BITCOUNT_0                 (0x1U<<4)
#define PPB_ID_ISAR0_BITFIELD                   (0xFU<<8)
#define PPB_ID_ISAR0_BITFIELD_0                 (0x1U<<8)
#define PPB_ID_ISAR0_CMPBRANCH                  (0xFU<<12)
#define PPB_ID_ISAR0_CMPBRANCH_0                (0x1U<<12)
#define PPB_ID_ISAR0_COPROC                     (0xFU<<16)
#define PPB_ID_ISAR0_COPROC_0                   (0x1U<<16)
#define PPB_ID_ISAR0_DEBUG                      (0xFU<<20)
#define PPB_ID_ISAR0_DEBUG_0                    (0x1U<<20)
#define PPB_ID_ISAR0_DIVIDE                     (0xFU<<24)
#define PPB_ID_ISAR0_DIVIDE_0                   (0x1U<<24)

// ID_ISAR1 Configuration

#define PPB_ID_ISAR1_EXTEND                     (0xFU<<12)
#define PPB_ID_ISAR1_EXTEND_0                   (0x1U<<12)
#define PPB_ID_ISAR1_IFTHEN                     (0xFU<<16)
#define PPB_ID_ISAR1_IFTHEN_0                   (0x1U<<16)
#define PPB_ID_ISAR1_IMMEDIATE                  (0xFU<<20)
#define PPB_ID_ISAR1_IMMEDIATE_0                (0x1U<<20)
#define PPB_ID_ISAR1_INTERWORK                  (0xFU<<24)
#define PPB_ID_ISAR1_INTERWORK_0                (0x1U<<24)

// ID_ISAR2 Configuration

#define PPB_ID_ISAR2_LOADSTORE                  (0xFU<<0)
#define PPB_ID_ISAR2_LOADSTORE_0                (0x1U<<0)
#define PPB_ID_ISAR2_MEMHINT                    (0xFU<<4)
#define PPB_ID_ISAR2_MEMHINT_0                  (0x1U<<4)
#define PPB_ID_ISAR2_MULTIACCESSINT             (0xFU<<8)
#define PPB_ID_ISAR2_MULTIACCESSINT_0           (0x1U<<8)
#define PPB_ID_ISAR2_MULT                       (0xFU<<12)
#define PPB_ID_ISAR2_MULT_0                     (0x1U<<12)
#define PPB_ID_ISAR2_MULTS                      (0xFU<<16)
#define PPB_ID_ISAR2_MULTS_0                    (0x1U<<16)
#define PPB_ID_ISAR2_MULTU                      (0xFU<<20)
#define PPB_ID_ISAR2_MULTU_0                    (0x1U<<20)
#define PPB_ID_ISAR2_REVERSAL                   (0xFU<<28)
#define PPB_ID_ISAR2_REVERSAL_0                 (0x1U<<28)

// ID_ISAR3 Configuration

#define PPB_ID_ISAR3_SATURATE                   (0xFU<<0)
#define PPB_ID_ISAR3_SATURATE_0                 (0x1U<<0)
#define PPB_ID_ISAR3_SIMD                       (0xFU<<4)
#define PPB_ID_ISAR3_SIMD_0                     (0x1U<<4)
#define PPB_ID_ISAR3_SVC                        (0xFU<<8)
#define PPB_ID_ISAR3_SVC_0                      (0x1U<<8)
#define PPB_ID_ISAR3_SYNCHPRIM                  (0xFU<<12)
#define PPB_ID_ISAR3_SYNCHPRIM_0                (0x1U<<12)
#define PPB_ID_ISAR3_TABBRANCH                  (0xFU<<16)
#define PPB_ID_ISAR3_TABBRANCH_0                (0x1U<<16)
#define PPB_ID_ISAR3_T32COPY                    (0xFU<<20)
#define PPB_ID_ISAR3_T32COPY_0                  (0x1U<<20)
#define PPB_ID_ISAR3_TRUENOP                    (0xFU<<24)
#define PPB_ID_ISAR3_TRUENOP_0                  (0x1U<<24)

// ID_ISAR4 Configuration

#define PPB_ID_ISAR4_UNPRIV                     (0xFU<<0)
#define PPB_ID_ISAR4_UNPRIV_0                   (0x1U<<0)
#define PPB_ID_ISAR4_WITHSHIFTS                 (0xFU<<4)
#define PPB_ID_ISAR4_WITHSHIFTS_0               (0x1U<<4)
#define PPB_ID_ISAR4_WRITEBACK                  (0xFU<<8)
#define PPB_ID_ISAR4_WRITEBACK_0                (0x1U<<8)
#define PPB_ID_ISAR4_BARRIER                    (0xFU<<16)
#define PPB_ID_ISAR4_BARRIER_0                  (0x1U<<16)
#define PPB_ID_ISAR4_SYNCPRIM_FRAC              (0xFU<<20)
#define PPB_ID_ISAR4_SYNCPRIM_FRAC_0            (0x1U<<20)
#define PPB_ID_ISAR4_PSR_M                      (0xFU<<24)
#define PPB_ID_ISAR4_PSR_M_0                    (0x1U<<24)

// ID_ISAR5 Configuration

#define PPB_ID_ISAR5_ID_ISAR5                   (0xFFFFFFFFU<<0)
#define PPB_ID_ISAR5_ID_ISAR5_0                 (0x1U<<0)

// CTR Configuration

#define PPB_CTR_IMINLINE                        (0xFU<<0)
#define PPB_CTR_IMINLINE_0                      (0x1U<<0)
#define PPB_CTR_RES1_1                          (0x3U<<14)
#define PPB_CTR_RES1_1_0                        (0x1U<<14)
#define PPB_CTR_DMINLINE                        (0xFU<<16)
#define PPB_CTR_DMINLINE_0                      (0x1U<<16)
#define PPB_CTR_ERG                             (0xFU<<20)
#define PPB_CTR_ERG_0                           (0x1U<<20)
#define PPB_CTR_CWG                             (0xFU<<24)
#define PPB_CTR_CWG_0                           (0x1U<<24)
#define PPB_CTR_RES1                            (0x1U<<31)

// CPACR Configuration

#define PPB_CPACR_CP0                           (0x3U<<0)
#define PPB_CPACR_CP0_0                         (0x1U<<0)
#define PPB_CPACR_CP1                           (0x3U<<2)
#define PPB_CPACR_CP1_0                         (0x1U<<2)
#define PPB_CPACR_CP2                           (0x3U<<4)
#define PPB_CPACR_CP2_0                         (0x1U<<4)
#define PPB_CPACR_CP3                           (0x3U<<6)
#define PPB_CPACR_CP3_0                         (0x1U<<6)
#define PPB_CPACR_CP4                           (0x3U<<8)
#define PPB_CPACR_CP4_0                         (0x1U<<8)
#define PPB_CPACR_CP5                           (0x3U<<10)
#define PPB_CPACR_CP5_0                         (0x1U<<10)
#define PPB_CPACR_CP6                           (0x3U<<12)
#define PPB_CPACR_CP6_0                         (0x1U<<12)
#define PPB_CPACR_CP7                           (0x3U<<14)
#define PPB_CPACR_CP7_0                         (0x1U<<14)
#define PPB_CPACR_CP10                          (0x3U<<20)
#define PPB_CPACR_CP10_0                        (0x1U<<20)
#define PPB_CPACR_CP11                          (0x3U<<22)
#define PPB_CPACR_CP11_0                        (0x1U<<22)

// NSACR Configuration

#define PPB_NSACR_CP0                           (0x1U<<0)
#define PPB_NSACR_CP1                           (0x1U<<1)
#define PPB_NSACR_CP2                           (0x1U<<2)
#define PPB_NSACR_CP3                           (0x1U<<3)
#define PPB_NSACR_CP4                           (0x1U<<4)
#define PPB_NSACR_CP5                           (0x1U<<5)
#define PPB_NSACR_CP6                           (0x1U<<6)
#define PPB_NSACR_CP7                           (0x1U<<7)
#define PPB_NSACR_CP10                          (0x1U<<10)
#define PPB_NSACR_CP11                          (0x1U<<11)

// MPU_TYPE Configuration

#define PPB_MPU_TYPE_SEPARATE                   (0x1U<<0)
#define PPB_MPU_TYPE_DREGION                    (0xFFU<<8)
#define PPB_MPU_TYPE_DREGION_0                  (0x1U<<8)

// MPU_CTRL Configuration

