Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_ppb.h
#define PPB_MPU_CTRL_ENABLE                     (0x1U<<0)
#define PPB_MPU_CTRL_HFNMIENA                   (0x1U<<1)
#define PPB_MPU_CTRL_PRIVDEFENA                 (0x1U<<2)

// MPU_RNR Configuration

#define PPB_MPU_RNR_REGION                      (0x7U<<0)
#define PPB_MPU_RNR_REGION_0                    (0x1U<<0)

// MPU_RBAR Configuration

#define PPB_MPU_RBAR_XN                         (0x1U<<0)
#define PPB_MPU_RBAR_AP                         (0x3U<<1)
#define PPB_MPU_RBAR_AP_0                       (0x1U<<1)
#define PPB_MPU_RBAR_SH                         (0x3U<<3)
#define PPB_MPU_RBAR_SH_0                       (0x1U<<3)
#define PPB_MPU_RBAR_BASE                       (0x7FFFFFFU<<5)
#define PPB_MPU_RBAR_BASE_0                     (0x1U<<5)

// MPU_RLAR Configuration

#define PPB_MPU_RLAR_EN                         (0x1U<<0)
#define PPB_MPU_RLAR_ATTRINDX                   (0x7U<<1)
#define PPB_MPU_RLAR_ATTRINDX_0                 (0x1U<<1)
#define PPB_MPU_RLAR_LIMIT                      (0x7FFFFFFU<<5)
#define PPB_MPU_RLAR_LIMIT_0                    (0x1U<<5)

// MPU_RBAR_A1 Configuration

#define PPB_MPU_RBAR_A1_XN                      (0x1U<<0)
#define PPB_MPU_RBAR_A1_AP                      (0x3U<<1)
#define PPB_MPU_RBAR_A1_AP_0                    (0x1U<<1)
#define PPB_MPU_RBAR_A1_SH                      (0x3U<<3)
#define PPB_MPU_RBAR_A1_SH_0                    (0x1U<<3)
#define PPB_MPU_RBAR_A1_BASE                    (0x7FFFFFFU<<5)
#define PPB_MPU_RBAR_A1_BASE_0                  (0x1U<<5)

// MPU_RLAR_A1 Configuration

#define PPB_MPU_RLAR_A1_EN                      (0x1U<<0)
#define PPB_MPU_RLAR_A1_ATTRINDX                (0x7U<<1)
#define PPB_MPU_RLAR_A1_ATTRINDX_0              (0x1U<<1)
#define PPB_MPU_RLAR_A1_LIMIT                   (0x7FFFFFFU<<5)
#define PPB_MPU_RLAR_A1_LIMIT_0                 (0x1U<<5)

// MPU_RBAR_A2 Configuration

#define PPB_MPU_RBAR_A2_XN                      (0x1U<<0)
#define PPB_MPU_RBAR_A2_AP                      (0x3U<<1)
#define PPB_MPU_RBAR_A2_AP_0                    (0x1U<<1)
#define PPB_MPU_RBAR_A2_SH                      (0x3U<<3)
#define PPB_MPU_RBAR_A2_SH_0                    (0x1U<<3)
#define PPB_MPU_RBAR_A2_BASE                    (0x7FFFFFFU<<5)
#define PPB_MPU_RBAR_A2_BASE_0                  (0x1U<<5)

// MPU_RLAR_A2 Configuration

#define PPB_MPU_RLAR_A2_EN                      (0x1U<<0)
#define PPB_MPU_RLAR_A2_ATTRINDX                (0x7U<<1)
#define PPB_MPU_RLAR_A2_ATTRINDX_0              (0x1U<<1)
#define PPB_MPU_RLAR_A2_LIMIT                   (0x7FFFFFFU<<5)
#define PPB_MPU_RLAR_A2_LIMIT_0                 (0x1U<<5)

// MPU_RBAR_A3 Configuration

#define PPB_MPU_RBAR_A3_XN                      (0x1U<<0)
#define PPB_MPU_RBAR_A3_AP                      (0x3U<<1)
#define PPB_MPU_RBAR_A3_AP_0                    (0x1U<<1)
#define PPB_MPU_RBAR_A3_SH                      (0x3U<<3)
#define PPB_MPU_RBAR_A3_SH_0                    (0x1U<<3)
#define PPB_MPU_RBAR_A3_BASE                    (0x7FFFFFFU<<5)
#define PPB_MPU_RBAR_A3_BASE_0                  (0x1U<<5)

// MPU_RLAR_A3 Configuration

#define PPB_MPU_RLAR_A3_EN                      (0x1U<<0)
#define PPB_MPU_RLAR_A3_ATTRINDX                (0x7U<<1)
#define PPB_MPU_RLAR_A3_ATTRINDX_0              (0x1U<<1)
#define PPB_MPU_RLAR_A3_LIMIT                   (0x7FFFFFFU<<5)
#define PPB_MPU_RLAR_A3_LIMIT_0                 (0x1U<<5)

// MPU_MAIR0 Configuration

#define PPB_MPU_MAIR0_ATTR0                     (0xFFU<<0)
#define PPB_MPU_MAIR0_ATTR0_0                   (0x1U<<0)
#define PPB_MPU_MAIR0_ATTR1                     (0xFFU<<8)
#define PPB_MPU_MAIR0_ATTR1_0                   (0x1U<<8)
#define PPB_MPU_MAIR0_ATTR2                     (0xFFU<<16)
#define PPB_MPU_MAIR0_ATTR2_0                   (0x1U<<16)
#define PPB_MPU_MAIR0_ATTR3                     (0xFFU<<24)
#define PPB_MPU_MAIR0_ATTR3_0                   (0x1U<<24)

// MPU_MAIR1 Configuration

#define PPB_MPU_MAIR1_ATTR4                     (0xFFU<<0)
#define PPB_MPU_MAIR1_ATTR4_0                   (0x1U<<0)
#define PPB_MPU_MAIR1_ATTR5                     (0xFFU<<8)
#define PPB_MPU_MAIR1_ATTR5_0                   (0x1U<<8)
#define PPB_MPU_MAIR1_ATTR6                     (0xFFU<<16)
#define PPB_MPU_MAIR1_ATTR6_0                   (0x1U<<16)
#define PPB_MPU_MAIR1_ATTR7                     (0xFFU<<24)
#define PPB_MPU_MAIR1_ATTR7_0                   (0x1U<<24)

// SAU_CTRL Configuration

#define PPB_SAU_CTRL_ENABLE                     (0x1U<<0)
#define PPB_SAU_CTRL_ALLNS                      (0x1U<<1)

// SAU_TYPE Configuration

#define PPB_SAU_TYPE_SREGION                    (0xFFU<<0)
#define PPB_SAU_TYPE_SREGION_0                  (0x1U<<0)

// SAU_RNR Configuration

#define PPB_SAU_RNR_REGION                      (0xFFU<<0)
#define PPB_SAU_RNR_REGION_0                    (0x1U<<0)

// SAU_RBAR Configuration

#define PPB_SAU_RBAR_BADDR                      (0x7FFFFFFU<<5)
#define PPB_SAU_RBAR_BADDR_0                    (0x1U<<5)

// SAU_RLAR Configuration

#define PPB_SAU_RLAR_ENABLE                     (0x1U<<0)
#define PPB_SAU_RLAR_NSC                        (0x1U<<1)
#define PPB_SAU_RLAR_LADDR                      (0x7FFFFFFU<<5)
#define PPB_SAU_RLAR_LADDR_0                    (0x1U<<5)

// SFSR Configuration

#define PPB_SFSR_INVEP                          (0x1U<<0)
#define PPB_SFSR_INVIS                          (0x1U<<1)
#define PPB_SFSR_INVER                          (0x1U<<2)
#define PPB_SFSR_AUVIOL                         (0x1U<<3)
#define PPB_SFSR_INVTRAN                        (0x1U<<4)
#define PPB_SFSR_LSPERR                         (0x1U<<5)
#define PPB_SFSR_SFARVALID                      (0x1U<<6)
#define PPB_SFSR_LSERR                          (0x1U<<7)

// SFAR Configuration

#define PPB_SFAR_ADDRESS                        (0xFFFFFFFFU<<0)
#define PPB_SFAR_ADDRESS_0                      (0x1U<<0)

// DHCSR Configuration

#define PPB_DHCSR_C_DEBUGEN                     (0x1U<<0)
#define PPB_DHCSR_C_HALT                        (0x1U<<1)
#define PPB_DHCSR_C_STEP                        (0x1U<<2)
#define PPB_DHCSR_C_MASKINTS                    (0x1U<<3)
#define PPB_DHCSR_C_SNAPSTALL                   (0x1U<<5)
#define PPB_DHCSR_S_REGRDY                      (0x1U<<16)
#define PPB_DHCSR_S_HALT                        (0x1U<<17)
#define PPB_DHCSR_S_SLEEP                       (0x1U<<18)
#define PPB_DHCSR_S_LOCKUP                      (0x1U<<19)
#define PPB_DHCSR_S_SDE                         (0x1U<<20)
#define PPB_DHCSR_S_RETIRE_ST                   (0x1U<<24)
#define PPB_DHCSR_S_RESET_ST                    (0x1U<<25)
#define PPB_DHCSR_S_RESTART_ST                  (0x1U<<26)

// DCRSR Configuration

#define PPB_DCRSR_REGSEL                        (0x7FU<<0)
#define PPB_DCRSR_REGSEL_0                      (0x1U<<0)
#define PPB_DCRSR_REGWNR                        (0x1U<<16)

// DCRDR Configuration

#define PPB_DCRDR_DBGTMP                        (0xFFFFFFFFU<<0)
#define PPB_DCRDR_DBGTMP_0                      (0x1U<<0)

// DEMCR Configuration

