Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_ppb.h
#define PPB_DEMCR_VC_CORERESET                  (0x1U<<0)
#define PPB_DEMCR_VC_MMERR                      (0x1U<<4)
#define PPB_DEMCR_VC_NOCPERR                    (0x1U<<5)
#define PPB_DEMCR_VC_CHKERR                     (0x1U<<6)
#define PPB_DEMCR_VC_STATERR                    (0x1U<<7)
#define PPB_DEMCR_VC_BUSERR                     (0x1U<<8)
#define PPB_DEMCR_VC_INTERR                     (0x1U<<9)
#define PPB_DEMCR_VC_HARDERR                    (0x1U<<10)
#define PPB_DEMCR_VC_SFERR                      (0x1U<<11)
#define PPB_DEMCR_MON_EN                        (0x1U<<16)
#define PPB_DEMCR_MON_PEND                      (0x1U<<17)
#define PPB_DEMCR_MON_STEP                      (0x1U<<18)
#define PPB_DEMCR_MON_REQ                       (0x1U<<19)
#define PPB_DEMCR_SDME                          (0x1U<<20)
#define PPB_DEMCR_TRCENA                        (0x1U<<24)

// DSCSR Configuration

#define PPB_DSCSR_SBRSELEN                      (0x1U<<0)
#define PPB_DSCSR_SBRSEL                        (0x1U<<1)
#define PPB_DSCSR_CDS                           (0x1U<<16)
#define PPB_DSCSR_CDSKEY                        (0x1U<<17)

// STIR Configuration

#define PPB_STIR_INTID                          (0x1FFU<<0)
#define PPB_STIR_INTID_0                        (0x1U<<0)

// FPCCR Configuration

#define PPB_FPCCR_LSPACT                        (0x1U<<0)
#define PPB_FPCCR_USER                          (0x1U<<1)
#define PPB_FPCCR_S                             (0x1U<<2)
#define PPB_FPCCR_THREAD                        (0x1U<<3)
#define PPB_FPCCR_HFRDY                         (0x1U<<4)
#define PPB_FPCCR_MMRDY                         (0x1U<<5)
#define PPB_FPCCR_BFRDY                         (0x1U<<6)
#define PPB_FPCCR_SFRDY                         (0x1U<<7)
#define PPB_FPCCR_MONRDY                        (0x1U<<8)
#define PPB_FPCCR_SPLIMVIOL                     (0x1U<<9)
#define PPB_FPCCR_UFRDY                         (0x1U<<10)
#define PPB_FPCCR_TS                            (0x1U<<26)
#define PPB_FPCCR_CLRONRETS                     (0x1U<<27)
#define PPB_FPCCR_CLRONRET                      (0x1U<<28)
#define PPB_FPCCR_LSPENS                        (0x1U<<29)
#define PPB_FPCCR_LSPEN                         (0x1U<<30)
#define PPB_FPCCR_ASPEN                         (0x1U<<31)

// FPCAR Configuration

#define PPB_FPCAR_ADDRESS                       (0x1FFFFFFFU<<3)
#define PPB_FPCAR_ADDRESS_0                     (0x1U<<3)

// FPDSCR Configuration

#define PPB_FPDSCR_RMODE                        (0x3U<<22)
#define PPB_FPDSCR_RMODE_0                      (0x1U<<22)
#define PPB_FPDSCR_FZ                           (0x1U<<24)
#define PPB_FPDSCR_DN                           (0x1U<<25)
#define PPB_FPDSCR_AHP                          (0x1U<<26)

// MVFR0 Configuration

#define PPB_MVFR0_SIMDREG                       (0xFU<<0)
#define PPB_MVFR0_SIMDREG_0                     (0x1U<<0)
#define PPB_MVFR0_FPSP                          (0xFU<<4)
#define PPB_MVFR0_FPSP_0                        (0x1U<<4)
#define PPB_MVFR0_FPDP                          (0xFU<<8)
#define PPB_MVFR0_FPDP_0                        (0x1U<<8)
#define PPB_MVFR0_FPDIVIDE                      (0xFU<<16)
#define PPB_MVFR0_FPDIVIDE_0                    (0x1U<<16)
#define PPB_MVFR0_FPSQRT                        (0xFU<<20)
#define PPB_MVFR0_FPSQRT_0                      (0x1U<<20)
#define PPB_MVFR0_FPROUND                       (0xFU<<28)
#define PPB_MVFR0_FPROUND_0                     (0x1U<<28)

// MVFR1 Configuration

#define PPB_MVFR1_FPFTZ                         (0xFU<<0)
#define PPB_MVFR1_FPFTZ_0                       (0x1U<<0)
#define PPB_MVFR1_FPDNAN                        (0xFU<<4)
#define PPB_MVFR1_FPDNAN_0                      (0x1U<<4)
#define PPB_MVFR1_FPHP                          (0xFU<<24)
#define PPB_MVFR1_FPHP_0                        (0x1U<<24)
#define PPB_MVFR1_FMAC                          (0xFU<<28)
#define PPB_MVFR1_FMAC_0                        (0x1U<<28)

// MVFR2 Configuration

#define PPB_MVFR2_FPMISC                        (0xFU<<4)
#define PPB_MVFR2_FPMISC_0                      (0x1U<<4)

// DDEVARCH Configuration

#define PPB_DDEVARCH_ARCHPART                   (0xFFFU<<0)
#define PPB_DDEVARCH_ARCHPART_0                 (0x1U<<0)
#define PPB_DDEVARCH_ARCHVER                    (0xFU<<12)
#define PPB_DDEVARCH_ARCHVER_0                  (0x1U<<12)
#define PPB_DDEVARCH_REVISION                   (0xFU<<16)
#define PPB_DDEVARCH_REVISION_0                 (0x1U<<16)
#define PPB_DDEVARCH_PRESENT                    (0x1U<<20)
#define PPB_DDEVARCH_ARCHITECT                  (0x7FFU<<21)
#define PPB_DDEVARCH_ARCHITECT_0                (0x1U<<21)

// DDEVTYPE Configuration

#define PPB_DDEVTYPE_MAJOR                      (0xFU<<0)
#define PPB_DDEVTYPE_MAJOR_0                    (0x1U<<0)
#define PPB_DDEVTYPE_SUB                        (0xFU<<4)
#define PPB_DDEVTYPE_SUB_0                      (0x1U<<4)

// DPIDR4 Configuration

#define PPB_DPIDR4_DES_2                        (0xFU<<0)
#define PPB_DPIDR4_DES_2_0                      (0x1U<<0)
#define PPB_DPIDR4_SIZE                         (0xFU<<4)
#define PPB_DPIDR4_SIZE_0                       (0x1U<<4)

// DPIDR5 Configuration

#define PPB_DPIDR5_DPIDR5                       (0xFFFFFFFFU<<0)
#define PPB_DPIDR5_DPIDR5_0                     (0x1U<<0)

// DPIDR6 Configuration

#define PPB_DPIDR6_DPIDR6                       (0xFFFFFFFFU<<0)
#define PPB_DPIDR6_DPIDR6_0                     (0x1U<<0)

// DPIDR7 Configuration

#define PPB_DPIDR7_DPIDR7                       (0xFFFFFFFFU<<0)
#define PPB_DPIDR7_DPIDR7_0                     (0x1U<<0)

// DPIDR0 Configuration

#define PPB_DPIDR0_PART_0                       (0xFFU<<0)
#define PPB_DPIDR0_PART_0_0                     (0x1U<<0)

// DPIDR1 Configuration

#define PPB_DPIDR1_PART_1                       (0xFU<<0)
#define PPB_DPIDR1_PART_1_0                     (0x1U<<0)
#define PPB_DPIDR1_DES_0                        (0xFU<<4)
#define PPB_DPIDR1_DES_0_0                      (0x1U<<4)

// DPIDR2 Configuration

#define PPB_DPIDR2_DES_1                        (0x7U<<0)
#define PPB_DPIDR2_DES_1_0                      (0x1U<<0)
#define PPB_DPIDR2_JEDEC                        (0x1U<<3)
#define PPB_DPIDR2_REVISION                     (0xFU<<4)
#define PPB_DPIDR2_REVISION_0                   (0x1U<<4)

// DPIDR3 Configuration

