Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_ppb.h
#define PPB_DPIDR3_CMOD                         (0xFU<<0)
#define PPB_DPIDR3_CMOD_0                       (0x1U<<0)
#define PPB_DPIDR3_REVAND                       (0xFU<<4)
#define PPB_DPIDR3_REVAND_0                     (0x1U<<4)

// DCIDR0 Configuration

#define PPB_DCIDR0_PRMBL_0                      (0xFFU<<0)
#define PPB_DCIDR0_PRMBL_0_0                    (0x1U<<0)

// DCIDR1 Configuration

#define PPB_DCIDR1_PRMBL_1                      (0xFU<<0)
#define PPB_DCIDR1_PRMBL_1_0                    (0x1U<<0)
#define PPB_DCIDR1_CLASS                        (0xFU<<4)
#define PPB_DCIDR1_CLASS_0                      (0x1U<<4)

// DCIDR2 Configuration

#define PPB_DCIDR2_PRMBL_2                      (0xFFU<<0)
#define PPB_DCIDR2_PRMBL_2_0                    (0x1U<<0)

// DCIDR3 Configuration

#define PPB_DCIDR3_PRMBL_3                      (0xFFU<<0)
#define PPB_DCIDR3_PRMBL_3_0                    (0x1U<<0)

// TRCPRGCTLR Configuration

#define PPB_TRCPRGCTLR_EN                       (0x1U<<0)

// TRCSTATR Configuration

#define PPB_TRCSTATR_IDLE                       (0x1U<<0)
#define PPB_TRCSTATR_PMSTABLE                   (0x1U<<1)

// TRCCONFIGR Configuration

#define PPB_TRCCONFIGR_BB                       (0x1U<<3)
#define PPB_TRCCONFIGR_CCI                      (0x1U<<4)
#define PPB_TRCCONFIGR_COND                     (0x3FU<<5)
#define PPB_TRCCONFIGR_COND_0                   (0x1U<<5)
#define PPB_TRCCONFIGR_TS                       (0x1U<<11)
#define PPB_TRCCONFIGR_RS                       (0x1U<<12)

// TRCEVENTCTL0R Configuration

#define PPB_TRCEVENTCTL0R_SEL0                  (0x7U<<0)
#define PPB_TRCEVENTCTL0R_SEL0_0                (0x1U<<0)
#define PPB_TRCEVENTCTL0R_TYPE0                 (0x1U<<7)
#define PPB_TRCEVENTCTL0R_SEL1                  (0x7U<<8)
#define PPB_TRCEVENTCTL0R_SEL1_0                (0x1U<<8)
#define PPB_TRCEVENTCTL0R_TYPE1                 (0x1U<<15)

// TRCEVENTCTL1R Configuration

#define PPB_TRCEVENTCTL1R_INSTEN0               (0x1U<<0)
#define PPB_TRCEVENTCTL1R_INSTEN1               (0x1U<<1)
#define PPB_TRCEVENTCTL1R_ATB                   (0x1U<<11)
#define PPB_TRCEVENTCTL1R_LPOVERRIDE            (0x1U<<12)

// TRCSTALLCTLR Configuration

#define PPB_TRCSTALLCTLR_LEVEL                  (0x3U<<2)
#define PPB_TRCSTALLCTLR_LEVEL_0                (0x1U<<2)
#define PPB_TRCSTALLCTLR_ISTALL                 (0x1U<<8)
#define PPB_TRCSTALLCTLR_INSTPRIORITY           (0x1U<<10)

// TRCTSCTLR Configuration

#define PPB_TRCTSCTLR_SEL0                      (0x3U<<0)
#define PPB_TRCTSCTLR_SEL0_0                    (0x1U<<0)
#define PPB_TRCTSCTLR_TYPE0                     (0x1U<<7)

// TRCSYNCPR Configuration

#define PPB_TRCSYNCPR_PERIOD                    (0x1FU<<0)
#define PPB_TRCSYNCPR_PERIOD_0                  (0x1U<<0)

// TRCCCCTLR Configuration

#define PPB_TRCCCCTLR_THRESHOLD                 (0xFFFU<<0)
#define PPB_TRCCCCTLR_THRESHOLD_0               (0x1U<<0)

// TRCVICTLR Configuration

#define PPB_TRCVICTLR_SEL0                      (0x3U<<0)
#define PPB_TRCVICTLR_SEL0_0                    (0x1U<<0)
#define PPB_TRCVICTLR_TYPE0                     (0x1U<<7)
#define PPB_TRCVICTLR_SSSTATUS                  (0x1U<<9)
#define PPB_TRCVICTLR_TRCRESET                  (0x1U<<10)
#define PPB_TRCVICTLR_TRCERR                    (0x1U<<11)
#define PPB_TRCVICTLR_EXLEVEL_S0                (0x1U<<16)
#define PPB_TRCVICTLR_EXLEVEL_S3                (0x1U<<19)

// TRCCNTRLDVR0 Configuration

#define PPB_TRCCNTRLDVR0_VALUE                  (0xFFFFU<<0)
#define PPB_TRCCNTRLDVR0_VALUE_0                (0x1U<<0)

// TRCIDR8 Configuration

#define PPB_TRCIDR8_MAXSPEC                     (0xFFFFFFFFU<<0)
#define PPB_TRCIDR8_MAXSPEC_0                   (0x1U<<0)

// TRCIDR9 Configuration

#define PPB_TRCIDR9_NUMP0KEY                    (0xFFFFFFFFU<<0)
#define PPB_TRCIDR9_NUMP0KEY_0                  (0x1U<<0)

// TRCIDR10 Configuration

#define PPB_TRCIDR10_NUMP1KEY                   (0xFFFFFFFFU<<0)
#define PPB_TRCIDR10_NUMP1KEY_0                 (0x1U<<0)

// TRCIDR11 Configuration

#define PPB_TRCIDR11_NUMP1SPC                   (0xFFFFFFFFU<<0)
#define PPB_TRCIDR11_NUMP1SPC_0                 (0x1U<<0)

// TRCIDR12 Configuration

#define PPB_TRCIDR12_NUMCONDKEY                 (0xFFFFFFFFU<<0)
#define PPB_TRCIDR12_NUMCONDKEY_0               (0x1U<<0)

// TRCIDR13 Configuration

#define PPB_TRCIDR13_NUMCONDSPC                 (0xFFFFFFFFU<<0)
#define PPB_TRCIDR13_NUMCONDSPC_0               (0x1U<<0)

// TRCIMSPEC Configuration

#define PPB_TRCIMSPEC_SUPPORT                   (0xFU<<0)
#define PPB_TRCIMSPEC_SUPPORT_0                 (0x1U<<0)

// TRCIDR0 Configuration

#define PPB_TRCIDR0_RES1                        (0x1U<<0)
#define PPB_TRCIDR0_INSTP0                      (0x3U<<1)
#define PPB_TRCIDR0_INSTP0_0                    (0x1U<<1)
#define PPB_TRCIDR0_TRCDATA                     (0x3U<<3)
#define PPB_TRCIDR0_TRCDATA_0                   (0x1U<<3)
#define PPB_TRCIDR0_TRCBB                       (0x1U<<5)
#define PPB_TRCIDR0_TRCCOND                     (0x1U<<6)
#define PPB_TRCIDR0_TRCCCI                      (0x1U<<7)
#define PPB_TRCIDR0_RETSTACK                    (0x1U<<9)
#define PPB_TRCIDR0_NUMEVENT                    (0x3U<<10)
#define PPB_TRCIDR0_NUMEVENT_0                  (0x1U<<10)
#define PPB_TRCIDR0_CONDTYPE                    (0x3U<<12)
#define PPB_TRCIDR0_CONDTYPE_0                  (0x1U<<12)
#define PPB_TRCIDR0_QFILT                       (0x1U<<14)
#define PPB_TRCIDR0_QSUPP                       (0x3U<<15)
#define PPB_TRCIDR0_QSUPP_0                     (0x1U<<15)
#define PPB_TRCIDR0_TRCEXDATA                   (0x1U<<17)
#define PPB_TRCIDR0_TSSIZE                      (0x1FU<<24)
#define PPB_TRCIDR0_TSSIZE_0                    (0x1U<<24)
#define PPB_TRCIDR0_COMMOPT                     (0x1U<<29)

// TRCIDR1 Configuration

#define PPB_TRCIDR1_REVISION                    (0xFU<<0)
#define PPB_TRCIDR1_REVISION_0                  (0x1U<<0)
#define PPB_TRCIDR1_TRCARCHMIN                  (0xFU<<4)
#define PPB_TRCIDR1_TRCARCHMIN_0                (0x1U<<4)
#define PPB_TRCIDR1_TRCARCHMAJ                  (0xFU<<8)
#define PPB_TRCIDR1_TRCARCHMAJ_0                (0x1U<<8)
#define PPB_TRCIDR1_RES1                        (0xFU<<12)
#define PPB_TRCIDR1_RES1_0                      (0x1U<<12)
#define PPB_TRCIDR1_DESIGNER                    (0xFFU<<24)
#define PPB_TRCIDR1_DESIGNER_0                  (0x1U<<24)

// TRCIDR2 Configuration

#define PPB_TRCIDR2_IASIZE                      (0x1FU<<0)
#define PPB_TRCIDR2_IASIZE_0                    (0x1U<<0)
#define PPB_TRCIDR2_CIDSIZE                     (0x1FU<<5)
#define PPB_TRCIDR2_CIDSIZE_0                   (0x1U<<5)
#define PPB_TRCIDR2_VMIDSIZE                    (0x1FU<<10)
#define PPB_TRCIDR2_VMIDSIZE_0                  (0x1U<<10)
#define PPB_TRCIDR2_DASIZE                      (0x1FU<<15)
#define PPB_TRCIDR2_DASIZE_0                    (0x1U<<15)
#define PPB_TRCIDR2_DVSIZE                      (0x1FU<<20)
#define PPB_TRCIDR2_DVSIZE_0                    (0x1U<<20)
#define PPB_TRCIDR2_CCSIZE                      (0xFU<<25)
#define PPB_TRCIDR2_CCSIZE_0                    (0x1U<<25)

// TRCIDR3 Configuration

#define PPB_TRCIDR3_CCITMIN                     (0xFFFU<<0)
#define PPB_TRCIDR3_CCITMIN_0                   (0x1U<<0)
#define PPB_TRCIDR3_EXLEVEL_S                   (0xFU<<16)
#define PPB_TRCIDR3_EXLEVEL_S_0                 (0x1U<<16)
#define PPB_TRCIDR3_EXLEVEL_NS                  (0xFU<<20)
#define PPB_TRCIDR3_EXLEVEL_NS_0                (0x1U<<20)
#define PPB_TRCIDR3_TRCERR                      (0x1U<<24)
#define PPB_TRCIDR3_SYNCPR                      (0x1U<<25)
#define PPB_TRCIDR3_STALLCTL                    (0x1U<<26)
#define PPB_TRCIDR3_SYSSTALL                    (0x1U<<27)
#define PPB_TRCIDR3_NUMPROC                     (0x7U<<28)
#define PPB_TRCIDR3_NUMPROC_0                   (0x1U<<28)
#define PPB_TRCIDR3_NOOVERFLOW                  (0x1U<<31)

// TRCIDR4 Configuration

#define PPB_TRCIDR4_NUMACPAIRS                  (0xFU<<0)
#define PPB_TRCIDR4_NUMACPAIRS_0                (0x1U<<0)
#define PPB_TRCIDR4_NUMDVC                      (0xFU<<4)
#define PPB_TRCIDR4_NUMDVC_0                    (0x1U<<4)
#define PPB_TRCIDR4_SUPPDAC                     (0x1U<<8)
#define PPB_TRCIDR4_NUMPC                       (0xFU<<12)
#define PPB_TRCIDR4_NUMPC_0                     (0x1U<<12)
#define PPB_TRCIDR4_NUMRSPAIR                   (0xFU<<16)
#define PPB_TRCIDR4_NUMRSPAIR_0                 (0x1U<<16)
#define PPB_TRCIDR4_NUMSSCC                     (0xFU<<20)
#define PPB_TRCIDR4_NUMSSCC_0                   (0x1U<<20)
#define PPB_TRCIDR4_NUMCIDC                     (0xFU<<24)
#define PPB_TRCIDR4_NUMCIDC_0                   (0x1U<<24)
#define PPB_TRCIDR4_NUMVMIDC                    (0xFU<<28)
#define PPB_TRCIDR4_NUMVMIDC_0                  (0x1U<<28)

// TRCIDR5 Configuration

