Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_ppb.h
#define PPB_TRCIDR5_NUMEXTIN                    (0x1FFU<<0)
#define PPB_TRCIDR5_NUMEXTIN_0                  (0x1U<<0)
#define PPB_TRCIDR5_NUMEXTINSEL                 (0x7U<<9)
#define PPB_TRCIDR5_NUMEXTINSEL_0               (0x1U<<9)
#define PPB_TRCIDR5_TRACEIDSIZE                 (0x3FU<<16)
#define PPB_TRCIDR5_TRACEIDSIZE_0               (0x1U<<16)
#define PPB_TRCIDR5_ATBTRIG                     (0x1U<<22)
#define PPB_TRCIDR5_LPOVERRIDE                  (0x1U<<23)
#define PPB_TRCIDR5_NUMSEQSTATE                 (0x7U<<25)
#define PPB_TRCIDR5_NUMSEQSTATE_0               (0x1U<<25)
#define PPB_TRCIDR5_NUMCNTR                     (0x7U<<28)
#define PPB_TRCIDR5_NUMCNTR_0                   (0x1U<<28)
#define PPB_TRCIDR5_REDFUNCNTR                  (0x1U<<31)

// TRCIDR6 Configuration

#define PPB_TRCIDR6_TRCIDR6                     (0xFFFFFFFFU<<0)
#define PPB_TRCIDR6_TRCIDR6_0                   (0x1U<<0)

// TRCIDR7 Configuration

#define PPB_TRCIDR7_TRCIDR7                     (0xFFFFFFFFU<<0)
#define PPB_TRCIDR7_TRCIDR7_0                   (0x1U<<0)

// TRCRSCTLR2 Configuration

#define PPB_TRCRSCTLR2_SELECT                   (0xFFU<<0)
#define PPB_TRCRSCTLR2_SELECT_0                 (0x1U<<0)
#define PPB_TRCRSCTLR2_GROUP                    (0x7U<<16)
#define PPB_TRCRSCTLR2_GROUP_0                  (0x1U<<16)
#define PPB_TRCRSCTLR2_INV                      (0x1U<<20)
#define PPB_TRCRSCTLR2_PAIRINV                  (0x1U<<21)

// TRCRSCTLR3 Configuration

#define PPB_TRCRSCTLR3_SELECT                   (0xFFU<<0)
#define PPB_TRCRSCTLR3_SELECT_0                 (0x1U<<0)
#define PPB_TRCRSCTLR3_GROUP                    (0x7U<<16)
#define PPB_TRCRSCTLR3_GROUP_0                  (0x1U<<16)
#define PPB_TRCRSCTLR3_INV                      (0x1U<<20)
#define PPB_TRCRSCTLR3_PAIRINV                  (0x1U<<21)

// TRCSSCSR Configuration

#define PPB_TRCSSCSR_INST                       (0x1U<<0)
#define PPB_TRCSSCSR_DA                         (0x1U<<1)
#define PPB_TRCSSCSR_DV                         (0x1U<<2)
#define PPB_TRCSSCSR_PC                         (0x1U<<3)
#define PPB_TRCSSCSR_STATUS                     (0x1U<<31)

// TRCSSPCICR Configuration

#define PPB_TRCSSPCICR_PC                       (0xFU<<0)
#define PPB_TRCSSPCICR_PC_0                     (0x1U<<0)

// TRCPDCR Configuration

#define PPB_TRCPDCR_PU                          (0x1U<<3)

// TRCPDSR Configuration

#define PPB_TRCPDSR_POWER                       (0x1U<<0)
#define PPB_TRCPDSR_STICKYPD                    (0x1U<<1)
#define PPB_TRCPDSR_OSLK                        (0x1U<<5)

// TRCITATBIDR Configuration

#define PPB_TRCITATBIDR_ID                      (0x7FU<<0)
#define PPB_TRCITATBIDR_ID_0                    (0x1U<<0)

// TRCITIATBINR Configuration

#define PPB_TRCITIATBINR_ATREADYM               (0x1U<<0)
#define PPB_TRCITIATBINR_AFVALIDM               (0x1U<<1)

// TRCITIATBOUTR Configuration

#define PPB_TRCITIATBOUTR_ATVALID               (0x1U<<0)
#define PPB_TRCITIATBOUTR_AFREADY               (0x1U<<1)

// TRCCLAIMSET Configuration

#define PPB_TRCCLAIMSET_SET0                    (0x1U<<0)
#define PPB_TRCCLAIMSET_SET1                    (0x1U<<1)
#define PPB_TRCCLAIMSET_SET2                    (0x1U<<2)
#define PPB_TRCCLAIMSET_SET3                    (0x1U<<3)

// TRCCLAIMCLR Configuration

#define PPB_TRCCLAIMCLR_CLR0                    (0x1U<<0)
#define PPB_TRCCLAIMCLR_CLR1                    (0x1U<<1)
#define PPB_TRCCLAIMCLR_CLR2                    (0x1U<<2)
#define PPB_TRCCLAIMCLR_CLR3                    (0x1U<<3)

// TRCAUTHSTATUS Configuration

#define PPB_TRCAUTHSTATUS_NSID                  (0x3U<<0)
#define PPB_TRCAUTHSTATUS_NSID_0                (0x1U<<0)
#define PPB_TRCAUTHSTATUS_NSNID                 (0x3U<<2)
#define PPB_TRCAUTHSTATUS_NSNID_0               (0x1U<<2)
#define PPB_TRCAUTHSTATUS_SID                   (0x3U<<4)
#define PPB_TRCAUTHSTATUS_SID_0                 (0x1U<<4)
#define PPB_TRCAUTHSTATUS_SNID                  (0x3U<<6)
#define PPB_TRCAUTHSTATUS_SNID_0                (0x1U<<6)

// TRCDEVARCH Configuration

#define PPB_TRCDEVARCH_ARCHID                   (0xFFFFU<<0)
#define PPB_TRCDEVARCH_ARCHID_0                 (0x1U<<0)
#define PPB_TRCDEVARCH_REVISION                 (0xFU<<16)
#define PPB_TRCDEVARCH_REVISION_0               (0x1U<<16)
#define PPB_TRCDEVARCH_PRESENT                  (0x1U<<20)
#define PPB_TRCDEVARCH_ARCHITECT                (0x7FFU<<21)
#define PPB_TRCDEVARCH_ARCHITECT_0              (0x1U<<21)

// TRCDEVID Configuration

#define PPB_TRCDEVID_TRCDEVID                   (0xFFFFFFFFU<<0)
#define PPB_TRCDEVID_TRCDEVID_0                 (0x1U<<0)

// TRCDEVTYPE Configuration

#define PPB_TRCDEVTYPE_MAJOR                    (0xFU<<0)
#define PPB_TRCDEVTYPE_MAJOR_0                  (0x1U<<0)
#define PPB_TRCDEVTYPE_SUB                      (0xFU<<4)
#define PPB_TRCDEVTYPE_SUB_0                    (0x1U<<4)

// TRCPIDR4 Configuration

#define PPB_TRCPIDR4_DES_2                      (0xFU<<0)
#define PPB_TRCPIDR4_DES_2_0                    (0x1U<<0)
#define PPB_TRCPIDR4_SIZE                       (0xFU<<4)
#define PPB_TRCPIDR4_SIZE_0                     (0x1U<<4)

// TRCPIDR5 Configuration

#define PPB_TRCPIDR5_TRCPIDR5                   (0xFFFFFFFFU<<0)
#define PPB_TRCPIDR5_TRCPIDR5_0                 (0x1U<<0)

// TRCPIDR6 Configuration

#define PPB_TRCPIDR6_TRCPIDR6                   (0xFFFFFFFFU<<0)
#define PPB_TRCPIDR6_TRCPIDR6_0                 (0x1U<<0)

// TRCPIDR7 Configuration

#define PPB_TRCPIDR7_TRCPIDR7                   (0xFFFFFFFFU<<0)
#define PPB_TRCPIDR7_TRCPIDR7_0                 (0x1U<<0)

// TRCPIDR0 Configuration

#define PPB_TRCPIDR0_PART_0                     (0xFFU<<0)
#define PPB_TRCPIDR0_PART_0_0                   (0x1U<<0)

// TRCPIDR1 Configuration

#define PPB_TRCPIDR1_PART_0                     (0xFU<<0)
#define PPB_TRCPIDR1_PART_0_0                   (0x1U<<0)
#define PPB_TRCPIDR1_DES_0                      (0xFU<<4)
#define PPB_TRCPIDR1_DES_0_0                    (0x1U<<4)

// TRCPIDR2 Configuration

#define PPB_TRCPIDR2_DES_0                      (0x7U<<0)
#define PPB_TRCPIDR2_DES_0_0                    (0x1U<<0)
#define PPB_TRCPIDR2_JEDEC                      (0x1U<<3)
#define PPB_TRCPIDR2_REVISION                   (0xFU<<4)
#define PPB_TRCPIDR2_REVISION_0                 (0x1U<<4)

// TRCPIDR3 Configuration

