Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_ppb.h
#define PPB_TRCPIDR3_CMOD                       (0xFU<<0)
#define PPB_TRCPIDR3_CMOD_0                     (0x1U<<0)
#define PPB_TRCPIDR3_REVAND                     (0xFU<<4)
#define PPB_TRCPIDR3_REVAND_0                   (0x1U<<4)

// TRCCIDR0 Configuration

#define PPB_TRCCIDR0_PRMBL_0                    (0xFFU<<0)
#define PPB_TRCCIDR0_PRMBL_0_0                  (0x1U<<0)

// TRCCIDR1 Configuration

#define PPB_TRCCIDR1_PRMBL_1                    (0xFU<<0)
#define PPB_TRCCIDR1_PRMBL_1_0                  (0x1U<<0)
#define PPB_TRCCIDR1_CLASS                      (0xFU<<4)
#define PPB_TRCCIDR1_CLASS_0                    (0x1U<<4)

// TRCCIDR2 Configuration

#define PPB_TRCCIDR2_PRMBL_2                    (0xFFU<<0)
#define PPB_TRCCIDR2_PRMBL_2_0                  (0x1U<<0)

// TRCCIDR3 Configuration

#define PPB_TRCCIDR3_PRMBL_3                    (0xFFU<<0)
#define PPB_TRCCIDR3_PRMBL_3_0                  (0x1U<<0)

// CTICONTROL Configuration

#define PPB_CTICONTROL_GLBEN                    (0x1U<<0)

// CTIINTACK Configuration

#define PPB_CTIINTACK_INTACK                    (0xFFU<<0)
#define PPB_CTIINTACK_INTACK_0                  (0x1U<<0)

// CTIAPPSET Configuration

#define PPB_CTIAPPSET_APPSET                    (0xFU<<0)
#define PPB_CTIAPPSET_APPSET_0                  (0x1U<<0)

// CTIAPPCLEAR Configuration

#define PPB_CTIAPPCLEAR_APPCLEAR                (0xFU<<0)
#define PPB_CTIAPPCLEAR_APPCLEAR_0              (0x1U<<0)

// CTIAPPPULSE Configuration

#define PPB_CTIAPPPULSE_APPULSE                 (0xFU<<0)
#define PPB_CTIAPPPULSE_APPULSE_0               (0x1U<<0)

// CTIINEN0 Configuration

#define PPB_CTIINEN0_TRIGINEN                   (0xFU<<0)
#define PPB_CTIINEN0_TRIGINEN_0                 (0x1U<<0)

// CTIINEN1 Configuration

#define PPB_CTIINEN1_TRIGINEN                   (0xFU<<0)
#define PPB_CTIINEN1_TRIGINEN_0                 (0x1U<<0)

// CTIINEN2 Configuration

#define PPB_CTIINEN2_TRIGINEN                   (0xFU<<0)
#define PPB_CTIINEN2_TRIGINEN_0                 (0x1U<<0)

// CTIINEN3 Configuration

#define PPB_CTIINEN3_TRIGINEN                   (0xFU<<0)
#define PPB_CTIINEN3_TRIGINEN_0                 (0x1U<<0)

// CTIINEN4 Configuration

#define PPB_CTIINEN4_TRIGINEN                   (0xFU<<0)
#define PPB_CTIINEN4_TRIGINEN_0                 (0x1U<<0)

// CTIINEN5 Configuration

#define PPB_CTIINEN5_TRIGINEN                   (0xFU<<0)
#define PPB_CTIINEN5_TRIGINEN_0                 (0x1U<<0)

// CTIINEN6 Configuration

#define PPB_CTIINEN6_TRIGINEN                   (0xFU<<0)
#define PPB_CTIINEN6_TRIGINEN_0                 (0x1U<<0)

// CTIINEN7 Configuration

#define PPB_CTIINEN7_TRIGINEN                   (0xFU<<0)
#define PPB_CTIINEN7_TRIGINEN_0                 (0x1U<<0)

// CTIOUTEN0 Configuration

#define PPB_CTIOUTEN0_TRIGOUTEN                 (0xFU<<0)
#define PPB_CTIOUTEN0_TRIGOUTEN_0               (0x1U<<0)

// CTIOUTEN1 Configuration

#define PPB_CTIOUTEN1_TRIGOUTEN                 (0xFU<<0)
#define PPB_CTIOUTEN1_TRIGOUTEN_0               (0x1U<<0)

// CTIOUTEN2 Configuration

#define PPB_CTIOUTEN2_TRIGOUTEN                 (0xFU<<0)
#define PPB_CTIOUTEN2_TRIGOUTEN_0               (0x1U<<0)

// CTIOUTEN3 Configuration

#define PPB_CTIOUTEN3_TRIGOUTEN                 (0xFU<<0)
#define PPB_CTIOUTEN3_TRIGOUTEN_0               (0x1U<<0)

// CTIOUTEN4 Configuration

#define PPB_CTIOUTEN4_TRIGOUTEN                 (0xFU<<0)
#define PPB_CTIOUTEN4_TRIGOUTEN_0               (0x1U<<0)

// CTIOUTEN5 Configuration

#define PPB_CTIOUTEN5_TRIGOUTEN                 (0xFU<<0)
#define PPB_CTIOUTEN5_TRIGOUTEN_0               (0x1U<<0)

// CTIOUTEN6 Configuration

#define PPB_CTIOUTEN6_TRIGOUTEN                 (0xFU<<0)
#define PPB_CTIOUTEN6_TRIGOUTEN_0               (0x1U<<0)

// CTIOUTEN7 Configuration

#define PPB_CTIOUTEN7_TRIGOUTEN                 (0xFU<<0)
#define PPB_CTIOUTEN7_TRIGOUTEN_0               (0x1U<<0)

// CTITRIGINSTATUS Configuration

#define PPB_CTITRIGINSTATUS_TRIGINSTATUS        (0xFFU<<0)
#define PPB_CTITRIGINSTATUS_TRIGINSTATUS_0      (0x1U<<0)

// CTITRIGOUTSTATUS Configuration

#define PPB_CTITRIGOUTSTATUS_TRIGOUTSTATUS      (0xFFU<<0)
#define PPB_CTITRIGOUTSTATUS_TRIGOUTSTATUS_0    (0x1U<<0)

// CTICHINSTATUS Configuration

#define PPB_CTICHINSTATUS_CTICHOUTSTATUS        (0xFU<<0)
#define PPB_CTICHINSTATUS_CTICHOUTSTATUS_0      (0x1U<<0)

// CTIGATE Configuration

#define PPB_CTIGATE_CTIGATEEN0                  (0x1U<<0)
#define PPB_CTIGATE_CTIGATEEN1                  (0x1U<<1)
#define PPB_CTIGATE_CTIGATEEN2                  (0x1U<<2)
#define PPB_CTIGATE_CTIGATEEN3                  (0x1U<<3)

// ASICCTL Configuration

#define PPB_ASICCTL_ASICCTL                     (0xFFFFFFFFU<<0)
#define PPB_ASICCTL_ASICCTL_0                   (0x1U<<0)

// ITCHOUT Configuration

#define PPB_ITCHOUT_CTCHOUT                     (0xFU<<0)
#define PPB_ITCHOUT_CTCHOUT_0                   (0x1U<<0)

// ITTRIGOUT Configuration

#define PPB_ITTRIGOUT_CTTRIGOUT                 (0xFFU<<0)
#define PPB_ITTRIGOUT_CTTRIGOUT_0               (0x1U<<0)

// ITCHIN Configuration

#define PPB_ITCHIN_CTCHIN                       (0xFU<<0)
#define PPB_ITCHIN_CTCHIN_0                     (0x1U<<0)

// ITCTRL Configuration

#define PPB_ITCTRL_IME                          (0x1U<<0)

// DEVARCH Configuration

#define PPB_DEVARCH_ARCHID                      (0xFFFFU<<0)
#define PPB_DEVARCH_ARCHID_0                    (0x1U<<0)
#define PPB_DEVARCH_REVISION                    (0xFU<<16)
#define PPB_DEVARCH_REVISION_0                  (0x1U<<16)
#define PPB_DEVARCH_PRESENT                     (0x1U<<20)
#define PPB_DEVARCH_ARCHITECT                   (0x7FFU<<21)
#define PPB_DEVARCH_ARCHITECT_0                 (0x1U<<21)

// DEVID Configuration

#define PPB_DEVID_EXTMUXNUM                     (0x1FU<<0)
#define PPB_DEVID_EXTMUXNUM_0                   (0x1U<<0)
#define PPB_DEVID_NUMTRIG                       (0xFFU<<8)
#define PPB_DEVID_NUMTRIG_0                     (0x1U<<8)
#define PPB_DEVID_NUMCH                         (0xFU<<16)
#define PPB_DEVID_NUMCH_0                       (0x1U<<16)

// DEVTYPE Configuration

#define PPB_DEVTYPE_MAJOR                       (0xFU<<0)
#define PPB_DEVTYPE_MAJOR_0                     (0x1U<<0)
#define PPB_DEVTYPE_SUB                         (0xFU<<4)
#define PPB_DEVTYPE_SUB_0                       (0x1U<<4)

// PIDR4 Configuration

#define PPB_PIDR4_DES_2                         (0xFU<<0)
#define PPB_PIDR4_DES_2_0                       (0x1U<<0)
#define PPB_PIDR4_SIZE                          (0xFU<<4)
#define PPB_PIDR4_SIZE_0                        (0x1U<<4)

// PIDR5 Configuration

#define PPB_PIDR5_PIDR5                         (0xFFFFFFFFU<<0)
#define PPB_PIDR5_PIDR5_0                       (0x1U<<0)

// PIDR6 Configuration

#define PPB_PIDR6_PIDR6                         (0xFFFFFFFFU<<0)
#define PPB_PIDR6_PIDR6_0                       (0x1U<<0)

// PIDR7 Configuration

#define PPB_PIDR7_PIDR7                         (0xFFFFFFFFU<<0)
#define PPB_PIDR7_PIDR7_0                       (0x1U<<0)

