Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_ppb.h
// PIDR0 Configuration

#define PPB_PIDR0_PART_0                        (0xFFU<<0)
#define PPB_PIDR0_PART_0_0                      (0x1U<<0)

// PIDR1 Configuration

#define PPB_PIDR1_PART_1                        (0xFU<<0)
#define PPB_PIDR1_PART_1_0                      (0x1U<<0)
#define PPB_PIDR1_DES_0                         (0xFU<<4)
#define PPB_PIDR1_DES_0_0                       (0x1U<<4)

// PIDR2 Configuration

#define PPB_PIDR2_DES_1                         (0x7U<<0)
#define PPB_PIDR2_DES_1_0                       (0x1U<<0)
#define PPB_PIDR2_JEDEC                         (0x1U<<3)
#define PPB_PIDR2_REVISION                      (0xFU<<4)
#define PPB_PIDR2_REVISION_0                    (0x1U<<4)

// PIDR3 Configuration

#define PPB_PIDR3_CMOD                          (0xFU<<0)
#define PPB_PIDR3_CMOD_0                        (0x1U<<0)
#define PPB_PIDR3_REVAND                        (0xFU<<4)
#define PPB_PIDR3_REVAND_0                      (0x1U<<4)

// CIDR0 Configuration

#define PPB_CIDR0_PRMBL_0                       (0xFFU<<0)
#define PPB_CIDR0_PRMBL_0_0                     (0x1U<<0)

// CIDR1 Configuration

#define PPB_CIDR1_PRMBL_1                       (0xFU<<0)
#define PPB_CIDR1_PRMBL_1_0                     (0x1U<<0)
#define PPB_CIDR1_CLASS                         (0xFU<<4)
#define PPB_CIDR1_CLASS_0                       (0x1U<<4)

// CIDR2 Configuration

#define PPB_CIDR2_PRMBL_2                       (0xFFU<<0)
#define PPB_CIDR2_PRMBL_2_0                     (0x1U<<0)

// CIDR3 Configuration

#define PPB_CIDR3_PRMBL_3                       (0xFFU<<0)
#define PPB_CIDR3_PRMBL_3_0                     (0x1U<<0)
